org/doc/vm-build.org
#+STARTUP: showall indent hidestars

#+TITLE: Построение виртуальной машины

* Интро

В этой статье построена простая стековая виртуальная машина на основе интерпретатора
байтода, реализованного на языке Си. Для нее написана программа, и приведен небольшой
бенчмарк.

По мотивам источников:
- https://habrahabr.ru/company/intel/blog/261665/
- https://habrahabr.ru/company/intel/blog/202926/
- https://github.com/grigory-rechistov/interpreters-comparison/
- https://habrahabr.ru/company/intel/blog/254419/
- https://habrahabr.ru/company/intel/blog/254027/

* Бенчмарк

Для сравнения производительности нужна была программа, написанная для этой ВМ. Она
должна была быть достаточно длинной, с нетривиальным потоком управления, не
использовать чрезмерно ввод-вывод, т.е. быть вычислительно-сложной. И при этом быть
достаточно простой, чтобы такой рассеянный человек, как я, смог бы отладить её в
машинных кодах даже без нормально работающего симулятора. В результате получилось то,
что я назвал Primes.

Primes выводит на экран все простые числа, содержащиеся на отрезке от 2 до 100000. Её
код для ВМ содержится в массиве Primes, одинаково объявленном во всех примерах.
Primes

Для сравнения производительности нужна была программа, написанная для этой ВМ. Она
должна была быть достаточно длинной, с нетривиальным потоком управления, не
использовать чрезмерно ввод-вывод, т.е. быть вычислительно-сложной. И при этом быть
достаточно простой, чтобы такой рассеянный человек, как я, смог бы отладить её в
машинных кодах даже без нормально работающего симулятора. В результате получилось то,
что я назвал Primes.

Primes выводит на экран все простые числа, содержащиеся на отрезке от 2 до 100000. Её
код для ВМ содержится в массиве Primes, одинаково объявленном во всех примерах.
Primes

#+BEGIN_SRC c
  const Instr_t Primes[PROGRAM_SIZE] = {
      Instr_Push, 100000, // nmax (maximal number to test)
      Instr_Push, 2,      // nmax, c (minimal number to test)
      /* back: */
      Instr_Over,         // nmax, c, nmax
      Instr_Over,         // nmax, c, nmax, c
      Instr_Sub,          // nmax, c, c-nmax
      Instr_JE, +23, /* end */ // nmax, c
      Instr_Push, 2,       // nmax, c, divisor
      /* back2: */
      Instr_Over,         // nmax, c, divisor, c
      Instr_Over,         // nmax, c, divisor, c, divisor
      Instr_Swap,          // nmax, c, divisor, divisor, c
      Instr_Sub,          // nmax, c, divisor, c-divisor
      Instr_JE, +9, /* print_prime */ // nmax, c, divisor
      Instr_Over,          // nmax, c, divisor, c
      Instr_Over,          // nmax, c, divisor, c, divisor
      Instr_Swap,          // nmax, c, divisor, divisor, c
      Instr_Mod,           // nmax, c, divisor, c mod divisor
      Instr_JE, +5, /* not_prime */ // nmax, c, divisor
      Instr_Inc,           // nmax, c, divisor+1
      Instr_Jump, -15, /* back2 */  // nmax, c, divisor
      /* print_prime: */
      Instr_Over,          // nmax, c, divisor, c
      Instr_Print,         // nmax, c, divisor
      /* not_prime */
      Instr_Drop,          // nmax, c
      Instr_Inc,           // nmax, c+1
      Instr_Jump, -28, /* back */   // nmax, c
      /* end: */
      Instr_Halt           // nmax, c (== nmax)
  };
#+END_SRC

В моих запусках она исполнялась от половины до трёх минут. Её алгоритм приблизительно
(с поправкой на стековую архитектуру) соответствует программе, содержащейся в файле

#+BEGIN_SRC C
int main() {
    for (int i = 2; i < 100000; i++) {
        bool is_prime = true;
        for (int divisor = 2; divisor < i; divisor++) {
            if (i % divisor == 0) {
                is_prime = false;
                break;
            }
        }
        if (is_prime)
            printf("[%d]\n", i);
    }
    return 0;
}
#+END_SRC

* Простейшие виртуальные машины

