www/doc/vm-build.html
<!DOCTYPE html>
<html>
<head>
<title>Построение виртуальной машины</title>
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="rigidus">
<link href="/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Построение виртуальной машины</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Интро</a></li>
<li><a href="#sec-2">Бенчмарк</a></li>
<li><a href="#sec-3">Простейшие виртуальные машины</a>
<ul>
<li><a href="#sec-3-1">Архитектура VM</a></li>
<li><a href="#sec-3-2">Описание набора инструкций</a></li>
<li><a href="#sec-3-3">Переключаемый интерпретатор</a>
<ul>
<li><a href="#sec-3-3-1">Чтение кода операции</a></li>
<li><a href="#sec-3-3-2">Распознавание операции</a></li>
<li><a href="#sec-3-3-3">Исполнение операций</a></li>
<li><a href="#sec-3-3-4">Предварительное декодирование (pre-decoding)</a></li>
</ul>
</li>
<li><a href="#sec-3-4">Шитый (threaded) код</a>
<ul>
<li><a href="#sec-3-4-1">Компилятор — заклятый друг</a></li>
</ul>
</li>
<li><a href="#sec-3-5">Процедурный (subroutined)</a></li>
<li><a href="#sec-3-6">Процедурный с хвостовой рекурсией (tailrecursive)</a></li>
<li><a href="#sec-3-7">Рудиментарный двоичный транслятор (binary translation)</a></li>
</ul>
</li>
<li><a href="#sec-4">Заключение</a></li>
<li><a href="#sec-5">Литература</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Интро</h2>
<div class="outline-text-2" id="text-1">
<p>
В этой статье построена простая стековая виртуальная машина на основе интерпретатора
байтода, реализованного на языке Си. Для нее написана программа, и приведен небольшой
бенчмарк.
</p>

<p>
По мотивам источников:
</p>
<ul class="org-ul">
<li><a href="https://habrahabr.ru/company/intel/blog/261665/">https://habrahabr.ru/company/intel/blog/261665/</a>
</li>
<li><a href="https://habrahabr.ru/company/intel/blog/202926/">https://habrahabr.ru/company/intel/blog/202926/</a>
</li>
<li><a href="https://github.com/grigory-rechistov/interpreters-comparison/">https://github.com/grigory-rechistov/interpreters-comparison/</a>
</li>
<li><a href="https://habrahabr.ru/company/intel/blog/254419/">https://habrahabr.ru/company/intel/blog/254419/</a>
</li>
<li><a href="https://habrahabr.ru/company/intel/blog/254027/">https://habrahabr.ru/company/intel/blog/254027/</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Бенчмарк</h2>
<div class="outline-text-2" id="text-2">
<p>
Для сравнения производительности нужна была программа, написанная для этой ВМ. Она
должна была быть достаточно длинной, с нетривиальным потоком управления, не
использовать чрезмерно ввод-вывод, т.е. быть вычислительно-сложной. И при этом быть
достаточно простой, чтобы такой рассеянный человек, как я, смог бы отладить её в
машинных кодах даже без нормально работающего симулятора. В результате получилось то,
что я назвал Primes.
</p>

<p>
Primes выводит на экран все простые числа, содержащиеся на отрезке от 2 до 100000. Её
код для ВМ содержится в массиве Primes, одинаково объявленном во всех примерах.
Primes
</p>

<p>
Для сравнения производительности нужна была программа, написанная для этой ВМ. Она
должна была быть достаточно длинной, с нетривиальным потоком управления, не
использовать чрезмерно ввод-вывод, т.е. быть вычислительно-сложной. И при этом быть
достаточно простой, чтобы такой рассеянный человек, как я, смог бы отладить её в
машинных кодах даже без нормально работающего симулятора. В результате получилось то,
что я назвал Primes.
</p>

<p>
Primes выводит на экран все простые числа, содержащиеся на отрезке от 2 до 100000. Её
код для ВМ содержится в массиве Primes, одинаково объявленном во всех примерах.
Primes
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">const</span> <span style="color: #228b22;">Instr_t</span> <span style="color: #a0522d;">Primes</span>[PROGRAM_SIZE] = {
    Instr_Push, 100000, <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax (maximal number to test)</span>
    Instr_Push, 2,      <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c (minimal number to test)</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">back: </span><span style="color: #b22222;">*/</span>
    Instr_Over,         <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, nmax</span>
    Instr_Over,         <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, nmax, c</span>
    Instr_Sub,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, c-nmax</span>
    Instr_JE, +23, <span style="color: #b22222;">/* </span><span style="color: #b22222;">end </span><span style="color: #b22222;">*/</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c</span>
    Instr_Push, 2,       <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">back2: </span><span style="color: #b22222;">*/</span>
    Instr_Over,         <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c</span>
    Instr_Over,         <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c, divisor</span>
    Instr_Swap,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, divisor, c</span>
    Instr_Sub,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c-divisor</span>
    Instr_JE, +9, <span style="color: #b22222;">/* </span><span style="color: #b22222;">print_prime </span><span style="color: #b22222;">*/</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor</span>
    Instr_Over,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c</span>
    Instr_Over,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c, divisor</span>
    Instr_Swap,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, divisor, c</span>
    Instr_Mod,           <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c mod divisor</span>
    Instr_JE, +5, <span style="color: #b22222;">/* </span><span style="color: #b22222;">not_prime </span><span style="color: #b22222;">*/</span> <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor</span>
    Instr_Inc,           <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor+1</span>
    Instr_Jump, -15, <span style="color: #b22222;">/* </span><span style="color: #b22222;">back2 </span><span style="color: #b22222;">*/</span>  <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">print_prime: </span><span style="color: #b22222;">*/</span>
    Instr_Over,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor, c</span>
    Instr_Print,         <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c, divisor</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">not_prime </span><span style="color: #b22222;">*/</span>
    Instr_Drop,          <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c</span>
    Instr_Inc,           <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c+1</span>
    Instr_Jump, -28, <span style="color: #b22222;">/* </span><span style="color: #b22222;">back </span><span style="color: #b22222;">*/</span>   <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c</span>
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">end: </span><span style="color: #b22222;">*/</span>
    Instr_Halt           <span style="color: #b22222;">// </span><span style="color: #b22222;">nmax, c (== nmax)</span>
};
</pre>
</div>

<p>
В моих запусках она исполнялась от половины до трёх минут. Её алгоритм приблизительно
(с поправкой на стековую архитектуру) соответствует программе, содержащейся в файле
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 2; i &lt; 100000; i++) {
        <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">is_prime</span> = <span style="color: #008b8b;">true</span>;
        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">divisor</span> = 2; divisor &lt; i; divisor++) {
            <span style="color: #a020f0;">if</span> (i % divisor == 0) {
                is_prime = <span style="color: #008b8b;">false</span>;
                <span style="color: #a020f0;">break</span>;
            }
        }
        <span style="color: #a020f0;">if</span> (is_prime)
            printf(<span style="color: #8b2252;">"[%d]\n"</span>, i);
    }
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Простейшие виртуальные машины</h2>
