org/doc/vm-build.org
** Архитектура VM

Ширина машинного слова - 32 бита. Все операнды и инструкции - это знаковые или
беззнаковые 32-битные целые числа.

Три состояния процессора: Running - активное исполнение инструкций; Halted - останов
после исполнение Halt, соответствует нормальному завершению программы; Break - останов
после любой ненормальной, неподдерживаемой или вызвавшей нестандартное состояние
инструкции, обозначает ошибку в программе. Другими словами, ВМ начинает работать в
состоянии Running. Заканчивает она работу в состоянии Halted, если в процессе работы не
произошло никаких непредвиденных событий и исполнение достигло инструкции Halt. Если
произошло деление на ноль, выход за границы кода, переполнение или опустошение стека,
или что-то ещё, что мне не захотелось поддерживать при реализации, она останавливается
в режиме Break.

Все регистры - неявные, а всего их два. PC - указатель текущей команды. SP - указатель
вершины стека. В начале работы PC=0, SP=-1.

Стек параметров глубиной 32 беззнаковых целых слова. SP указывает на текущий элемент,
или же равен -1, если стек пуст.

Программная память ёмкостью в 512 слов, доступная только на чтение. При выходе за
границы (0; 511) процессор останавливается в состоянии Break.

Инструкции могут иметь ноль или один явный операнд (imm). В первом случае они имеют
длину в одно слово, во втором - два.

Описание всех машинных инструкций.

Исполнение любой инструкции, не определённой в архитектуре явно, эквивалентно
исполнению Break.

Для нужд отладки процессор содержит 64-битный регистр steps, увеличивающийся на единицу
после каждой исполненной инструкции ВМ. Программы позволяют задать предел числа шагов,
после которого симуляция прерывается. По умолчанию он равен LLONG_MAX.

После завершения симуляции программы выводят состояние процессора и стека на экран.

** Описание набора инструкций

#+BEGIN_EXAMPLE
  Break = 0x0000 - перевести процессор в состояние Break. Так как неинициализированная программная память заполнена нулями, любой случайный переход «мимо кода» приводит к остановке.
  Nop = 0x0001 - пустая команда, не изменяющая стек и SP.
  Halt = 0x0002 - перевести процессор в состояние Halted.
  Push = 0x0003 imm - поместить константу imm на вершину стека.
  Print = 0x0004 - снять с вершины стека значение и распечатать его в десятичном виде.
  JNE = 0x0005 imm - снять с вершины стека значение, и, если оно не равно нулю, прибавить imm к PC. imm при этом трактуется как число со знаком.
  Swap = 0x0006 - переставить местами вершину стека и следующий за ний элемент.
  Dup = 0x0007 - поместить на вершину стека копию самого верхнего элемента.
  JE = 0x0008 imm - снять с вершины стека значение, и, если оно равно нулю, прибавить imm к PC. imm при этом трактуется как число со знаком.
  Inc = 0x0009 - прибавить к вершине стека единицу.
  Add = 0x000a - сложить два верхних элемента стека. Снять их со стека и поместить результат как вершину.
  Sub = 0x000b - вычесть из верхнего элемента стека следующий за ним. Снять их со стека и поместить результат на вершину.
  Mul = 0x000c - перемножить два верхних элемента стека. Снять их со стека и поместить результат как вершину.
  Rand = 0x000d - поместить на вершину стека случайное число.
  Dec = 0x000e - вычесть из вершины стека единицу.
  Drop = 0x000f - снять с вершины стека число и «выбросить» его.
  Over = 0x0010 - поместить на вершину стека копию элемента, являющегося вторым в стеке после вершины.
  Mod = 0x0011 - поделить верхний элемент стека на следующий за ним. Снять их со стека и поместить остаток от деления на вершину.
  Jump = 0x0012 imm - прибавить imm к PC. imm при этом трактуется как число со знаком.
#+END_EXAMPLE

** Переключаемый интерпретатор

Базовый цикл:
- считать код операции
- распознать операцию
- исполнить операцию
- повторить

*** Чтение кода операции

Функция ~fetch~ считывает код операции, находящийся по адресу PC (program counter). Так
как интерпретатор моделирует системную VM, необходимо быть готовым к выходу PC за
границы памяти: за проверку отвечает ~fetch_checked~:

#+BEGIN_SRC c
  static inline Instr_t fetch(const cpu_t *pcpu) {
      assert(pcpu);
      assert(pcpu->pc < PROGRAM_SIZE);
      return pcpu->pmem[pcpu->pc];
  };

  static inline Instr_t fetch_checked(cpu_t *pcpu) {
      if (!(pcpu->pc < PROGRAM_SIZE)) {
          printf("PC out of bounds\n");
          pcpu->state = Cpu_Break;
          return Instr_Break;
      }
      return fetch(pcpu);
  }
#+END_SRC

