www/doc/vm-build.html
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Архитектура VM</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Ширина машинного слова - 32 бита. Все операнды и инструкции - это знаковые или
беззнаковые 32-битные целые числа.
</p>

<p>
Три состояния процессора: Running - активное исполнение инструкций; Halted - останов
после исполнение Halt, соответствует нормальному завершению программы; Break - останов
после любой ненормальной, неподдерживаемой или вызвавшей нестандартное состояние
инструкции, обозначает ошибку в программе. Другими словами, ВМ начинает работать в
состоянии Running. Заканчивает она работу в состоянии Halted, если в процессе работы не
произошло никаких непредвиденных событий и исполнение достигло инструкции Halt. Если
произошло деление на ноль, выход за границы кода, переполнение или опустошение стека,
или что-то ещё, что мне не захотелось поддерживать при реализации, она останавливается
в режиме Break.
</p>

<p>
Все регистры - неявные, а всего их два. PC - указатель текущей команды. SP - указатель
вершины стека. В начале работы PC=0, SP=-1.
</p>

<p>
Стек параметров глубиной 32 беззнаковых целых слова. SP указывает на текущий элемент,
или же равен -1, если стек пуст.
</p>

<p>
Программная память ёмкостью в 512 слов, доступная только на чтение. При выходе за
границы (0; 511) процессор останавливается в состоянии Break.
</p>

<p>
Инструкции могут иметь ноль или один явный операнд (imm). В первом случае они имеют
длину в одно слово, во втором - два.
</p>

<p>
Описание всех машинных инструкций.
</p>

<p>
Исполнение любой инструкции, не определённой в архитектуре явно, эквивалентно
исполнению Break.
</p>

<p>
Для нужд отладки процессор содержит 64-битный регистр steps, увеличивающийся на единицу
после каждой исполненной инструкции ВМ. Программы позволяют задать предел числа шагов,
после которого симуляция прерывается. По умолчанию он равен LLONG<sub>MAX</sub>.
</p>

<p>
После завершения симуляции программы выводят состояние процессора и стека на экран.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Описание набора инструкций</h3>
<div class="outline-text-3" id="text-3-2">
<pre class="example">
Break = 0x0000 - перевести процессор в состояние Break. Так как неинициализированная программная память заполнена нулями, любой случайный переход «мимо кода» приводит к остановке.
Nop = 0x0001 - пустая команда, не изменяющая стек и SP.
Halt = 0x0002 - перевести процессор в состояние Halted.
Push = 0x0003 imm - поместить константу imm на вершину стека.
Print = 0x0004 - снять с вершины стека значение и распечатать его в десятичном виде.
JNE = 0x0005 imm - снять с вершины стека значение, и, если оно не равно нулю, прибавить imm к PC. imm при этом трактуется как число со знаком.
Swap = 0x0006 - переставить местами вершину стека и следующий за ний элемент.
Dup = 0x0007 - поместить на вершину стека копию самого верхнего элемента.
JE = 0x0008 imm - снять с вершины стека значение, и, если оно равно нулю, прибавить imm к PC. imm при этом трактуется как число со знаком.
Inc = 0x0009 - прибавить к вершине стека единицу.
Add = 0x000a - сложить два верхних элемента стека. Снять их со стека и поместить результат как вершину.
Sub = 0x000b - вычесть из верхнего элемента стека следующий за ним. Снять их со стека и поместить результат на вершину.
Mul = 0x000c - перемножить два верхних элемента стека. Снять их со стека и поместить результат как вершину.
Rand = 0x000d - поместить на вершину стека случайное число.
Dec = 0x000e - вычесть из вершины стека единицу.
Drop = 0x000f - снять с вершины стека число и «выбросить» его.
Over = 0x0010 - поместить на вершину стека копию элемента, являющегося вторым в стеке после вершины.
Mod = 0x0011 - поделить верхний элемент стека на следующий за ним. Снять их со стека и поместить остаток от деления на вершину.
Jump = 0x0012 imm - прибавить imm к PC. imm при этом трактуется как число со знаком.
</pre>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Переключаемый интерпретатор</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Базовый цикл:
</p>
<ul class="org-ul">
<li>считать код операции
</li>
<li>распознать операцию
</li>
<li>исполнить операцию
</li>
<li>повторить
</li>
</ul>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1">Чтение кода операции</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Функция <code>fetch</code> считывает код операции, находящийся по адресу PC (program counter). Так
как интерпретатор моделирует системную VM, необходимо быть готовым к выходу PC за
границы памяти: за проверку отвечает <code>fetch_checked</code>:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">static</span> <span style="color: #a020f0;">inline</span> <span style="color: #228b22;">Instr_t</span> <span style="color: #0000ff;">fetch</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">cpu_t</span> *<span style="color: #a0522d;">pcpu</span>) {
    assert(pcpu);
    assert(pcpu-&gt;pc &lt; PROGRAM_SIZE);
    <span style="color: #a020f0;">return</span> pcpu-&gt;pmem[pcpu-&gt;pc];
};

<span style="color: #a020f0;">static</span> <span style="color: #a020f0;">inline</span> <span style="color: #228b22;">Instr_t</span> <span style="color: #0000ff;">fetch_checked</span>(<span style="color: #228b22;">cpu_t</span> *<span style="color: #a0522d;">pcpu</span>) {
    <span style="color: #a020f0;">if</span> (!(pcpu-&gt;pc &lt; PROGRAM_SIZE)) {
        printf(<span style="color: #8b2252;">"PC out of bounds\n"</span>);
        pcpu-&gt;state = Cpu_Break;
        <span style="color: #a020f0;">return</span> Instr_Break;
    }
    <span style="color: #a020f0;">return</span> fetch(pcpu);
}
</pre>
</div>
</div>
</div>
