org/doc/vm-build.org
*** Распознавание операции

[TODO:gmm] Здесь можно было бы применить ESIL для независимости от архитектуры

Функция decode() должна завершить начатое в fetch() — полностью определить
характеристики команды. В нашем случае это её длина (1 или 2) и значение литерального
операнда для тех инструкций, у которых он есть. Кроме того, по принятым соглашениям все
неизвестные опкоды считаются эквивалентными Break. Всё это выясняется в результате
работы одного оператора switch.

Особенность обработки «длинных» инструкций с операндом: они требуют дополнительного
чтения памяти команд по адресу PC+1, который также необходимо проконтролировать на
выход за границы.

#+BEGIN_SRC c
  static inline decode_t decode(Instr_t raw_instr, const cpu_t *pcpu) {
      assert(pcpu);
      decode_t result = {0};
      result.opcode = raw_instr;
      switch (raw_instr) {
      case Instr_Nop:
      case Instr_Halt:
      case Instr_Print:
      case Instr_Swap:
      case Instr_Dup:
      case Instr_Inc:
      case Instr_Add:
      case Instr_Sub:
      case Instr_Mul:
      case Instr_Rand:
      case Instr_Dec:
      case Instr_Drop:
      case Instr_Over:
      case Instr_Mod:
          result.length = 1;
          break;
      case Instr_Push:
      case Instr_JNE:
      case Instr_JE:
      case Instr_Jump:
          result.length = 2;
          if (!(pcpu->pc+1 < PROGRAM_SIZE)) {
              printf("PC+1 out of bounds\n");
              pcpu->state = Cpu_Break;
              break;
          }
          result.immediate = (int32_t)pcpu->pmem[pcpu->pc+1];
          break;
      case Instr_Break:
      default: /* Undefined instructions equal to Break */
          result.length = 1;
          result.opcode = Instr_Break;
          break;
      }
      return result;
  }
#+END_SRC

Для более реалистичных архитектур процедура декодирования в программной ВМ несколько
сложнее: придётся искать по дереву префиксов, то есть проходить через серию вложенных
switch. Но я думаю, что общую идею передать удалось.

*** Исполнение операций

Наконец, исполнение — по коду операции, полученного из decode(), переходим на сервисную
процедуру (service routine) — блок кода, ответственный за семантику конкретной гостевой
инструкции.

#+BEGIN_SRC c
  uint32_t tmp1 = 0, tmp2 = 0;
  /* Execute - a big switch */
  switch(decoded.opcode) {
  case Instr_Nop:
      /* Do nothing */
      break;
  case Instr_Halt:
      cpu.state = Cpu_Halted;
      break;
  case Instr_Push:
      push(&cpu, decoded.immediate);
      break;
  case Instr_Print:
      tmp1 = pop(&cpu); BAIL_ON_ERROR();
      printf("[%d]\n", tmp1);
      break;
  case Instr_Swap:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1);
      push(&cpu, tmp2);
      break;
  case Instr_Dup:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1);
      push(&cpu, tmp1);
      break;
  case Instr_Over:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp2);
      push(&cpu, tmp1);
      push(&cpu, tmp2);
      break;
  case Instr_Inc:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1+1);
      break;
  case Instr_Add:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1 + tmp2);
      break;
  case Instr_Sub:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1 - tmp2);
      break;
  case Instr_Mod:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      if (tmp2 == 0) {
          cpu.state = Cpu_Break;
          break;
      }
      push(&cpu, tmp1 % tmp2);
      break;
  case Instr_Mul:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1 * tmp2);
      break;
  case Instr_Rand:
      tmp1 = rand();
      push(&cpu, tmp1);
      break;
  case Instr_Dec:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1-1);
      break;
  case Instr_Drop:
      (void)pop(&cpu);
      break;
  case Instr_JE:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      if (tmp1 == 0)
          cpu.pc += decoded.immediate;
      break;
  case Instr_JNE:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      if (tmp1 != 0)
          cpu.pc += decoded.immediate;
      break;
  case Instr_Jump:
      cpu.pc += decoded.immediate;
      break;
  case Instr_Break:
      cpu.state = Cpu_Break;
      break;
  default:
      assert("Unreachable" && false);
      break;
  }
#+END_SRC

Здесь и далее BAIL_ON_ERROR служит для перехвата возможных исключений, возникших в ходе
выполнения отдельных команд:

#+BEGIN_SRC c
  #define BAIL_ON_ERROR() if (cpu.state != Cpu_Running) break;
#+END_SRC

К сожалению, это Си, и использовать нормальный try-catch не получится (однако погодите,
ближе к концу статьи будет кое-что похожее на него).

Наблюдательный читатель может удивиться — зачем используются два switch: в decode() и в
main(), — ведь они вызываются один за другим и управляются одной и той же величиной, то
есть могут быть объединены. Необходимость такого разделения станет понятна в следующей
секции, где мы избавимся от необходимости постоянно вызывать decode().

