www/doc/vm-build.html

<div id="outline-container-sec-3-3-2" class="outline-4">
<h4 id="sec-3-3-2">Распознавание операции</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
[TODO:gmm] Здесь можно было бы применить ESIL для независимости от архитектуры
</p>

<p>
Функция decode() должна завершить начатое в fetch() — полностью определить
характеристики команды. В нашем случае это её длина (1 или 2) и значение литерального
операнда для тех инструкций, у которых он есть. Кроме того, по принятым соглашениям все
неизвестные опкоды считаются эквивалентными Break. Всё это выясняется в результате
работы одного оператора switch.
</p>

<p>
Особенность обработки «длинных» инструкций с операндом: они требуют дополнительного
чтения памяти команд по адресу PC+1, который также необходимо проконтролировать на
выход за границы.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">static</span> <span style="color: #a020f0;">inline</span> <span style="color: #228b22;">decode_t</span> <span style="color: #0000ff;">decode</span>(<span style="color: #228b22;">Instr_t</span> <span style="color: #a0522d;">raw_instr</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">cpu_t</span> *<span style="color: #a0522d;">pcpu</span>) {
    assert(pcpu);
    <span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">result</span> = {0};
    result.opcode = raw_instr;
    <span style="color: #a020f0;">switch</span> (raw_instr) {
    <span style="color: #a020f0;">case</span> Instr_Nop:
    <span style="color: #a020f0;">case</span> Instr_Halt:
    <span style="color: #a020f0;">case</span> Instr_Print:
    <span style="color: #a020f0;">case</span> Instr_Swap:
    <span style="color: #a020f0;">case</span> Instr_Dup:
    <span style="color: #a020f0;">case</span> Instr_Inc:
    <span style="color: #a020f0;">case</span> Instr_Add:
    <span style="color: #a020f0;">case</span> Instr_Sub:
    <span style="color: #a020f0;">case</span> Instr_Mul:
    <span style="color: #a020f0;">case</span> Instr_Rand:
    <span style="color: #a020f0;">case</span> Instr_Dec:
    <span style="color: #a020f0;">case</span> Instr_Drop:
    <span style="color: #a020f0;">case</span> Instr_Over:
    <span style="color: #a020f0;">case</span> Instr_Mod:
        result.length = 1;
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Push:
    <span style="color: #a020f0;">case</span> Instr_JNE:
    <span style="color: #a020f0;">case</span> Instr_JE:
    <span style="color: #a020f0;">case</span> Instr_Jump:
        result.length = 2;
        <span style="color: #a020f0;">if</span> (!(pcpu-&gt;pc+1 &lt; PROGRAM_SIZE)) {
            printf(<span style="color: #8b2252;">"PC+1 out of bounds\n"</span>);
            pcpu-&gt;state = Cpu_Break;
            <span style="color: #a020f0;">break</span>;
        }
        result.immediate = (<span style="color: #228b22;">int32_t</span>)pcpu-&gt;pmem[pcpu-&gt;pc+1];
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Break:
    <span style="color: #a020f0;">default</span>: <span style="color: #b22222;">/* </span><span style="color: #b22222;">Undefined instructions equal to Break </span><span style="color: #b22222;">*/</span>
        result.length = 1;
        result.opcode = Instr_Break;
        <span style="color: #a020f0;">break</span>;
    }
    <span style="color: #a020f0;">return</span> result;
}
</pre>
</div>

<p>
Для более реалистичных архитектур процедура декодирования в программной ВМ несколько
сложнее: придётся искать по дереву префиксов, то есть проходить через серию вложенных
switch. Но я думаю, что общую идею передать удалось.
</p>
</div>
</div>

<div id="outline-container-sec-3-3-3" class="outline-4">
<h4 id="sec-3-3-3">Исполнение операций</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
Наконец, исполнение — по коду операции, полученного из decode(), переходим на сервисную
процедуру (service routine) — блок кода, ответственный за семантику конкретной гостевой
инструкции.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">tmp1</span> = 0, <span style="color: #a0522d;">tmp2</span> = 0;
<span style="color: #b22222;">/* </span><span style="color: #b22222;">Execute - a big switch </span><span style="color: #b22222;">*/</span>
<span style="color: #a020f0;">switch</span>(decoded.opcode) {
<span style="color: #a020f0;">case</span> Instr_Nop:
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Do nothing </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Halt:
    cpu.state = Cpu_Halted;
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Push:
    push(&amp;cpu, decoded.immediate);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Print:
    tmp1 = pop(&amp;cpu); BAIL_ON_ERROR();
    printf(<span style="color: #8b2252;">"[%d]\n"</span>, tmp1);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Swap:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1);
    push(&amp;cpu, tmp2);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Dup:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1);
    push(&amp;cpu, tmp1);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Over:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp2);
    push(&amp;cpu, tmp1);
    push(&amp;cpu, tmp2);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Inc:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1+1);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Add:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1 + tmp2);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Sub:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1 - tmp2);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Mod:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    <span style="color: #a020f0;">if</span> (tmp2 == 0) {
        cpu.state = Cpu_Break;
        <span style="color: #a020f0;">break</span>;
    }
    push(&amp;cpu, tmp1 % tmp2);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Mul:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1 * tmp2);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Rand:
    tmp1 = rand();
    push(&amp;cpu, tmp1);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Dec:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1-1);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Drop:
    (<span style="color: #228b22;">void</span>)pop(&amp;cpu);
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_JE:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    <span style="color: #a020f0;">if</span> (tmp1 == 0)
        cpu.pc += decoded.immediate;
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_JNE:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    <span style="color: #a020f0;">if</span> (tmp1 != 0)
        cpu.pc += decoded.immediate;
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Jump:
    cpu.pc += decoded.immediate;
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">case</span> Instr_Break:
    cpu.state = Cpu_Break;
    <span style="color: #a020f0;">break</span>;
<span style="color: #a020f0;">default</span>:
    assert(<span style="color: #8b2252;">"Unreachable"</span> &amp;&amp; <span style="color: #008b8b;">false</span>);
    <span style="color: #a020f0;">break</span>;
}
</pre>
</div>

<p>
Здесь и далее BAIL<sub>ON</sub><sub>ERROR</sub> служит для перехвата возможных исключений, возникших в ходе
выполнения отдельных команд:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">BAIL_ON_ERROR</span>() <span style="color: #a020f0;">if</span> (cpu.state != Cpu_Running) <span style="color: #a020f0;">break</span>;
</pre>
</div>

<p>
К сожалению, это Си, и использовать нормальный try-catch не получится (однако погодите,
ближе к концу статьи будет кое-что похожее на него).
</p>

<p>
Наблюдательный читатель может удивиться — зачем используются два switch: в decode() и в
main(), — ведь они вызываются один за другим и управляются одной и той же величиной, то
есть могут быть объединены. Необходимость такого разделения станет понятна в следующей
секции, где мы избавимся от необходимости постоянно вызывать decode().
</p>
</div>
</div>
