org/doc/vm-build.org
*** Предварительное декодирование (pre-decoding)

Первое, от чего следует избавиться — это декодирование на каждом шаге симуляции (файл
predecoded.c). В самом деле, содержимое программы не меняется в процессе работы, или
меняется очень нечасто: при загрузке новых приложений или динамических библиотек,
изредка самим приложением (JIT-программа, дописывающая свои куски). В нашей ВМ вообще
нет возможности изменить программу в процессе выполнения, и этим надо воспользоваться.

#+BEGIN_SRC c
  static void predecode_program(const Instr_t *prog, decode_t *dec, int len) {
      assert(prog);
      assert(dec);
      /* The program is short, so we can decode it as a whole.
         Otherwise, some sort of lazy decoding will be required */
      for (int i=0; i < len; i++) {
          dec[i] = decode_at_address(prog, i);
      }
  }
#+END_SRC


Поскольку в памяти программ этой ВМ всего 512 слов, нам доступна возможность
декодировать её всю сразу и сохранить результат в массиве, индексированном значением
PC. В реальных ВМ с объёмами гостевой памяти 2³²–2⁶⁴ байт этот трюк не прошёл
бы. Пришлось бы использовать структуру а-ля кэш с вытеснением, который в ограниченном
объёме хозяйской памяти хранил бы рабочее множество соответствий «PC → decode_t». При
этом приходилось бы вносить новые записи в кэш декодированных инструкций при
симуляции. Однако и в этом случае был бы выигрыш в скорости. При повторном исполнении
недавно выполненных инструкций их не пришлось бы заново декодировать.

Ну а так — вызовем predecode_program() до исполнения:

#+BEGIN_SRC c
  decode_t decoded_cache[PROGRAM_SIZE];
  predecode_program(cpu.pmem, decoded_cache, PROGRAM_SIZE);

  while (cpu.state == Cpu_Running && cpu.steps < steplimit) {
      if (!(cpu.pc < PROGRAM_SIZE)) {
          printf("PC out of bounds\n");
          cpu.state = Cpu_Break;
          break;
      }

      decode_t decoded = decoded_cache[cpu.pc];
      uint32_t tmp1 = 0, tmp2 = 0;
  /* Execute - a big switch */
      switch(decoded.opcode) {
      case Instr_Nop:
  /* Do nothing */
          break;
      case Instr_Halt:
          cpu.state = Cpu_Halted;
          break;
      case Instr_Push:
          push(&cpu, decoded.immediate);
          break;
      case Instr_Print:
          tmp1 = pop(&cpu); BAIL_ON_ERROR();
          printf("[%d]\n", tmp1);
          break;
      case Instr_Swap:
          tmp1 = pop(&cpu);
          tmp2 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1);
          push(&cpu, tmp2);
          break;
      case Instr_Dup:
          tmp1 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1);
          push(&cpu, tmp1);
          break;
      case Instr_Over:
          tmp1 = pop(&cpu);
          tmp2 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp2);
          push(&cpu, tmp1);
          push(&cpu, tmp2);
          break;
      case Instr_Inc:
          tmp1 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1+1);
          break;
      case Instr_Add:
          tmp1 = pop(&cpu);
          tmp2 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1 + tmp2);
          break;
      case Instr_Sub:
          tmp1 = pop(&cpu);
          tmp2 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1 - tmp2);
          break;
      case Instr_Mod:
          tmp1 = pop(&cpu);
          tmp2 = pop(&cpu);
          BAIL_ON_ERROR();
          if (tmp2 == 0) {
              cpu.state = Cpu_Break;
              break;
          }
          push(&cpu, tmp1 % tmp2);
          break;
      case Instr_Mul:
          tmp1 = pop(&cpu);
          tmp2 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1 * tmp2);
          break;
      case Instr_Rand:
          tmp1 = rand();
          push(&cpu, tmp1);
          break;
      case Instr_Dec:
          tmp1 = pop(&cpu);
          BAIL_ON_ERROR();
          push(&cpu, tmp1-1);
          break;
      case Instr_Drop:
          (void)pop(&cpu);
          break;
      case Instr_JE:
          tmp1 = pop(&cpu);
          BAIL_ON_ERROR();
          if (tmp1 == 0)
              cpu.pc += decoded.immediate;
          break;
      case Instr_JNE:
          tmp1 = pop(&cpu);
          BAIL_ON_ERROR();
          if (tmp1 != 0)
              cpu.pc += decoded.immediate;
          break;
      case Instr_Jump:
          cpu.pc += decoded.immediate;
          break;
      case Instr_Break:
          cpu.state = Cpu_Break;
          break;
      default:
          assert("Unreachable" && false);
          break;
      }
      cpu.pc += decoded.length; /* Advance PC */
      cpu.steps++;
  }
#+END_SRC

Два замечания.
- Предварительное декодирование приводит к тому, что на этапе исполнения команд не
  выполняется фаза Fetch. При этом возникает риск некорректной симуляции архитектурных
  эффектов, с ней связанных, таких как срабатывание аппаратных точек останова. Эта
  проблема решаема аккуратным слежением за введённым кэшем.
- В отличие от системных ВМ, в языковых ВМ, которые обычно имеют очень простую
  структуру команд, фазы fetch и decode тривиальны. Поэтому для них подобное
  кэширование неприменимо.
