www/doc/vm-build.html

<div id="outline-container-sec-3-3-4" class="outline-4">
<h4 id="sec-3-3-4">Предварительное декодирование (pre-decoding)</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Первое, от чего следует избавиться — это декодирование на каждом шаге симуляции (файл
predecoded.c). В самом деле, содержимое программы не меняется в процессе работы, или
меняется очень нечасто: при загрузке новых приложений или динамических библиотек,
изредка самим приложением (JIT-программа, дописывающая свои куски). В нашей ВМ вообще
нет возможности изменить программу в процессе выполнения, и этим надо воспользоваться.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">predecode_program</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">Instr_t</span> *<span style="color: #a0522d;">prog</span>, <span style="color: #228b22;">decode_t</span> *<span style="color: #a0522d;">dec</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">len</span>) {
    assert(prog);
    assert(dec);
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">The program is short, so we can decode it as a whole.</span>
<span style="color: #b22222;">       Otherwise, some sort of lazy decoding will be required </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>=0; i &lt; len; i++) {
        dec[i] = decode_at_address(prog, i);
    }
}
</pre>
</div>


<p>
Поскольку в памяти программ этой ВМ всего 512 слов, нам доступна возможность
декодировать её всю сразу и сохранить результат в массиве, индексированном значением
PC. В реальных ВМ с объёмами гостевой памяти 2³²–2⁶⁴ байт этот трюк не прошёл
бы. Пришлось бы использовать структуру а-ля кэш с вытеснением, который в ограниченном
объёме хозяйской памяти хранил бы рабочее множество соответствий «PC → decode<sub>t»</sub>. При
этом приходилось бы вносить новые записи в кэш декодированных инструкций при
симуляции. Однако и в этом случае был бы выигрыш в скорости. При повторном исполнении
недавно выполненных инструкций их не пришлось бы заново декодировать.
</p>

<p>
Ну а так — вызовем predecode<sub>program</sub>() до исполнения:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">decoded_cache</span>[PROGRAM_SIZE];
predecode_program(cpu.pmem, decoded_cache, PROGRAM_SIZE);

<span style="color: #a020f0;">while</span> (cpu.state == Cpu_Running &amp;&amp; cpu.steps &lt; steplimit) {
    <span style="color: #a020f0;">if</span> (!(cpu.pc &lt; PROGRAM_SIZE)) {
        printf(<span style="color: #8b2252;">"PC out of bounds\n"</span>);
        cpu.state = Cpu_Break;
        <span style="color: #a020f0;">break</span>;
    }

    <span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">decoded</span> = decoded_cache[cpu.pc];
    <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">tmp1</span> = 0, <span style="color: #a0522d;">tmp2</span> = 0;
<span style="color: #b22222;">/* </span><span style="color: #b22222;">Execute - a big switch </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">switch</span>(decoded.opcode) {
    <span style="color: #a020f0;">case</span> Instr_Nop:
<span style="color: #b22222;">/* </span><span style="color: #b22222;">Do nothing </span><span style="color: #b22222;">*/</span>
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Halt:
        cpu.state = Cpu_Halted;
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Push:
        push(&amp;cpu, decoded.immediate);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Print:
        tmp1 = pop(&amp;cpu); BAIL_ON_ERROR();
        printf(<span style="color: #8b2252;">"[%d]\n"</span>, tmp1);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Swap:
        tmp1 = pop(&amp;cpu);
        tmp2 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1);
        push(&amp;cpu, tmp2);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Dup:
        tmp1 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1);
        push(&amp;cpu, tmp1);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Over:
        tmp1 = pop(&amp;cpu);
        tmp2 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp2);
        push(&amp;cpu, tmp1);
        push(&amp;cpu, tmp2);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Inc:
        tmp1 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1+1);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Add:
        tmp1 = pop(&amp;cpu);
        tmp2 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1 + tmp2);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Sub:
        tmp1 = pop(&amp;cpu);
        tmp2 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1 - tmp2);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Mod:
        tmp1 = pop(&amp;cpu);
        tmp2 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        <span style="color: #a020f0;">if</span> (tmp2 == 0) {
            cpu.state = Cpu_Break;
            <span style="color: #a020f0;">break</span>;
        }
        push(&amp;cpu, tmp1 % tmp2);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Mul:
        tmp1 = pop(&amp;cpu);
        tmp2 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1 * tmp2);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Rand:
        tmp1 = rand();
        push(&amp;cpu, tmp1);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Dec:
        tmp1 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        push(&amp;cpu, tmp1-1);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Drop:
        (<span style="color: #228b22;">void</span>)pop(&amp;cpu);
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_JE:
        tmp1 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        <span style="color: #a020f0;">if</span> (tmp1 == 0)
            cpu.pc += decoded.immediate;
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_JNE:
        tmp1 = pop(&amp;cpu);
        BAIL_ON_ERROR();
        <span style="color: #a020f0;">if</span> (tmp1 != 0)
            cpu.pc += decoded.immediate;
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Jump:
        cpu.pc += decoded.immediate;
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">case</span> Instr_Break:
        cpu.state = Cpu_Break;
        <span style="color: #a020f0;">break</span>;
    <span style="color: #a020f0;">default</span>:
        assert(<span style="color: #8b2252;">"Unreachable"</span> &amp;&amp; <span style="color: #008b8b;">false</span>);
        <span style="color: #a020f0;">break</span>;
    }
    cpu.pc += decoded.length; <span style="color: #b22222;">/* </span><span style="color: #b22222;">Advance PC </span><span style="color: #b22222;">*/</span>
    cpu.steps++;
}
</pre>
</div>

<p>
Два замечания.
</p>
<ul class="org-ul">
<li>Предварительное декодирование приводит к тому, что на этапе исполнения команд не
выполняется фаза Fetch. При этом возникает риск некорректной симуляции архитектурных
эффектов, с ней связанных, таких как срабатывание аппаратных точек останова. Эта
проблема решаема аккуратным слежением за введённым кэшем.
</li>
<li>В отличие от системных ВМ, в языковых ВМ, которые обычно имеют очень простую
структуру команд, фазы fetch и decode тривиальны. Поэтому для них подобное
кэширование неприменимо.
</li>
</ul>
</div>
</div>
</div>
