org/doc/vm-build.org
** Шитый (threaded) код

Необходимо помочь предсказателю переходов. При этом, конечно, неплохо бы знать, как он
работает, в деталях. За неимением (или нежеланием обращаться к) деталям используем
общие соображения. Вспомним, что предсказатель использует адрес самой инструкции для
ассоциации с ней истории переходов. Вот бы удалось «размазать» единственный jmp по
нескольким местам; с каждым из них будет связана своя локальная история, которая, можно
надеяться, будет менее хаотичной для совершения адекватных предсказаний.

Суть решения: после исполнения текущей сервисной процедуры не возвращаться в общую
точку (switch), а переходить сразу на сервисную процедуру следующей инструкции.

Плохая новость №1 — для перехода по метке придётся использовать оператор goto. Да, да,
знаю, goto это плохо, мкей, я и сам писал об этом. Ради скорости — во все тяжкие. В
коде ВМ это будет спрятано в макроcе DISPATCH:

#+BEGIN_SRC c
  #define DISPATCH() do {\
          goto *service_routines[decoded.opcode];   \
      } while(0);
#+END_SRC

Плохая новость №2: придётся использовать нестандартное (отсутствующее в стандарте Си)
расширение языка GCC — оператор взятия адреса метки &&:

#+BEGIN_SRC c
  const void* service_routines[] = {
      &&sr_Break, &&sr_Nop, &&sr_Halt, &&sr_Push, &&sr_Print,
      &&sr_Jne, &&sr_Swap, &&sr_Dup, &&sr_Je, &&sr_Inc,
      &&sr_Add, &&sr_Sub, &&sr_Mul, &&sr_Rand, &&sr_Dec,
      &&sr_Drop, &&sr_Over, &&sr_Mod, &&sr_Jump, NULL
  };
#+END_SRC

Данный нестандартный оператор поддерживается компиляторами GCC и ICC для языка Си (но,
насколько мне известно, не для C++).

В результате главный «цикл» (который на самом деле не делает ни одной итерации)
интерпретатора выглядит вот так:

#+BEGIN_SRC c
  decode_t decoded = {0};
  DISPATCH();
  do {
  sr_Nop:
      /* Do nothing */
      ADVANCE_PC();
      DISPATCH();
  sr_Halt:
      cpu.state = Cpu_Halted;
      ADVANCE_PC();
      /* No need to dispatch after Halt */
  sr_Push:
      push(&cpu, decoded.immediate);
      ADVANCE_PC();
      DISPATCH();
  sr_Print:
      tmp1 = pop(&cpu); BAIL_ON_ERROR();
      printf("[%d]\n", tmp1);
      ADVANCE_PC();
      DISPATCH();
  sr_Swap:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1);
      push(&cpu, tmp2);
      ADVANCE_PC();
      DISPATCH();
  sr_Dup:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1);
      push(&cpu, tmp1);
      ADVANCE_PC();
      DISPATCH();
  sr_Over:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp2);
      push(&cpu, tmp1);
      push(&cpu, tmp2);
      ADVANCE_PC();

      DISPATCH();
  sr_Inc:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1+1);
      ADVANCE_PC();
      DISPATCH();
  sr_Add:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1 + tmp2);
      ADVANCE_PC();
      DISPATCH();
  sr_Sub:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1 - tmp2);
      ADVANCE_PC();
      DISPATCH();
  sr_Mod:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      if (tmp2 == 0) {
          cpu.state = Cpu_Break;
          break;
      }
      push(&cpu, tmp1 % tmp2);
      ADVANCE_PC();
      DISPATCH();
  sr_Mul:
      tmp1 = pop(&cpu);
      tmp2 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1 * tmp2);
      ADVANCE_PC();
      DISPATCH();
  sr_Rand:
      tmp1 = rand();
      push(&cpu, tmp1);
      ADVANCE_PC();
      DISPATCH();
  sr_Dec:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      push(&cpu, tmp1-1);
      ADVANCE_PC();
      DISPATCH();
  sr_Drop:
      (void)pop(&cpu);
      ADVANCE_PC();
      DISPATCH();
  sr_Je:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      if (tmp1 == 0)
          cpu.pc += decoded.immediate;
      ADVANCE_PC();
      DISPATCH();
  sr_Jne:
      tmp1 = pop(&cpu);
      BAIL_ON_ERROR();
      if (tmp1 != 0)
          cpu.pc += decoded.immediate;
      ADVANCE_PC();
      DISPATCH();
  sr_Jump:
      cpu.pc += decoded.immediate;
      ADVANCE_PC();
      DISPATCH();
  sr_Break:
      cpu.state = Cpu_Break;
      ADVANCE_PC();
      /* No need to dispatch after Break */
  } while(cpu.state == Cpu_Running);
#+END_SRC

Симуляция начинается с первого DISPATCH и затем происходит как чехарда прыжков между
сервисными процедурами. Число хозяйских инструкций косвенных переходов в коде выросло,
и каждый их них теперь имеет ассоциированную историю для пары гостевых
инструкций. Вероятность неудачного предсказания при этом падает (в {4} утверждается,
что с 100% до 50%).

Данная техника имеет название шитый код, по-английски — threaded code; учтите, что
современный термин «thread — поток» появился значительно позже и не имеет отношения к
рассматриваемой теме.
Данная оптимизация и в наше время используется во вполне популярных
проектах. Процитирую пост Utter_step habrahabr.ru/post/261575 от 1 июля сего года:

    Vamsi Parasa из команды оптимизации серверных скриптовых языков Intel предложил
    патч <...>, переводящий блок switch, отвечающий за обработку Python-байткода, на
    использование computed goto, как это уже сделано в Python 3. Как объяснял Eli
    Bendersky, в таком огромном switch-блоке, как в блоке разбора байткода в CPython
    (состоящем из более чем 2000(!) строк), это даёт ускорение порядка 15-20%. Это
    происходит по двум причинам: computed goto, в отличие от switch-case, не производит
    граничных проверок, необходимых для оператора switch по стандарту C99, и, что,
    возможно, более важно, CPU может лучше прогнозировать ветвления в таких ситуациях
    <...>

