www/doc/vm-build.html
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Шитый (threaded) код</h3>
<div class="outline-text-3" id="text-3-4">
<p>
Необходимо помочь предсказателю переходов. При этом, конечно, неплохо бы знать, как он
работает, в деталях. За неимением (или нежеланием обращаться к) деталям используем
общие соображения. Вспомним, что предсказатель использует адрес самой инструкции для
ассоциации с ней истории переходов. Вот бы удалось «размазать» единственный jmp по
нескольким местам; с каждым из них будет связана своя локальная история, которая, можно
надеяться, будет менее хаотичной для совершения адекватных предсказаний.
</p>

<p>
Суть решения: после исполнения текущей сервисной процедуры не возвращаться в общую
точку (switch), а переходить сразу на сервисную процедуру следующей инструкции.
</p>

<p>
Плохая новость №1 — для перехода по метке придётся использовать оператор goto. Да, да,
знаю, goto это плохо, мкей, я и сам писал об этом. Ради скорости — во все тяжкие. В
коде ВМ это будет спрятано в макроcе DISPATCH:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">DISPATCH</span>() <span style="color: #a020f0;">do</span> {\
        <span style="color: #a020f0;">goto</span> *service_routines[decoded.opcode];   \
    } <span style="color: #a020f0;">while</span>(0);
</pre>
</div>

<p>
Плохая новость №2: придётся использовать нестандартное (отсутствующее в стандарте Си)
расширение языка GCC — оператор взятия адреса метки &amp;&amp;:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">const</span> <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">service_routines</span>[] = {
    &amp;&amp;sr_Break, &amp;&amp;sr_Nop, &amp;&amp;sr_Halt, &amp;&amp;sr_Push, &amp;&amp;sr_Print,
    &amp;&amp;sr_Jne, &amp;&amp;sr_Swap, &amp;&amp;sr_Dup, &amp;&amp;sr_Je, &amp;&amp;sr_Inc,
    &amp;&amp;sr_Add, &amp;&amp;sr_Sub, &amp;&amp;sr_Mul, &amp;&amp;sr_Rand, &amp;&amp;sr_Dec,
    &amp;&amp;sr_Drop, &amp;&amp;sr_Over, &amp;&amp;sr_Mod, &amp;&amp;sr_Jump, <span style="color: #008b8b;">NULL</span>
};
</pre>
</div>

<p>
Данный нестандартный оператор поддерживается компиляторами GCC и ICC для языка Си (но,
насколько мне известно, не для C++).
</p>

<p>
В результате главный «цикл» (который на самом деле не делает ни одной итерации)
интерпретатора выглядит вот так:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">decoded</span> = {0};
DISPATCH();
<span style="color: #a020f0;">do</span> {
<span style="color: #008b8b;">sr_Nop</span>:
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">Do nothing </span><span style="color: #b22222;">*/</span>
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Halt</span>:
    cpu.state = Cpu_Halted;
    ADVANCE_PC();
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">No need to dispatch after Halt </span><span style="color: #b22222;">*/</span>
<span style="color: #008b8b;">sr_Push</span>:
    push(&amp;cpu, decoded.immediate);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Print</span>:
    tmp1 = pop(&amp;cpu); BAIL_ON_ERROR();
    printf(<span style="color: #8b2252;">"[%d]\n"</span>, tmp1);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Swap</span>:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1);
    push(&amp;cpu, tmp2);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Dup</span>:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1);
    push(&amp;cpu, tmp1);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Over</span>:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp2);
    push(&amp;cpu, tmp1);
    push(&amp;cpu, tmp2);
    ADVANCE_PC();

    DISPATCH();
<span style="color: #008b8b;">sr_Inc</span>:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1+1);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Add</span>:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1 + tmp2);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Sub</span>:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1 - tmp2);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Mod</span>:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    <span style="color: #a020f0;">if</span> (tmp2 == 0) {
        cpu.state = Cpu_Break;
        <span style="color: #a020f0;">break</span>;
    }
    push(&amp;cpu, tmp1 % tmp2);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Mul</span>:
    tmp1 = pop(&amp;cpu);
    tmp2 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1 * tmp2);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Rand</span>:
    tmp1 = rand();
    push(&amp;cpu, tmp1);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Dec</span>:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    push(&amp;cpu, tmp1-1);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Drop</span>:
    (<span style="color: #228b22;">void</span>)pop(&amp;cpu);
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Je</span>:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    <span style="color: #a020f0;">if</span> (tmp1 == 0)
        cpu.pc += decoded.immediate;
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Jne</span>:
    tmp1 = pop(&amp;cpu);
    BAIL_ON_ERROR();
    <span style="color: #a020f0;">if</span> (tmp1 != 0)
        cpu.pc += decoded.immediate;
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Jump</span>:
    cpu.pc += decoded.immediate;
    ADVANCE_PC();
    DISPATCH();
<span style="color: #008b8b;">sr_Break</span>:
    cpu.state = Cpu_Break;
    ADVANCE_PC();
    <span style="color: #b22222;">/* </span><span style="color: #b22222;">No need to dispatch after Break </span><span style="color: #b22222;">*/</span>
} <span style="color: #a020f0;">while</span>(cpu.state == Cpu_Running);
</pre>
</div>

<p>
Симуляция начинается с первого DISPATCH и затем происходит как чехарда прыжков между
сервисными процедурами. Число хозяйских инструкций косвенных переходов в коде выросло,
и каждый их них теперь имеет ассоциированную историю для пары гостевых
инструкций. Вероятность неудачного предсказания при этом падает (в {4} утверждается,
что с 100% до 50%).
</p>

<p>
Данная техника имеет название шитый код, по-английски — threaded code; учтите, что
современный термин «thread — поток» появился значительно позже и не имеет отношения к
рассматриваемой теме.
Данная оптимизация и в наше время используется во вполне популярных
проектах. Процитирую пост Utter<sub>step</sub> habrahabr.ru/post/261575 от 1 июля сего года:
</p>

<p>
Vamsi Parasa из команды оптимизации серверных скриптовых языков Intel предложил
патч &lt;&#x2026;&gt;, переводящий блок switch, отвечающий за обработку Python-байткода, на
использование computed goto, как это уже сделано в Python 3. Как объяснял Eli
Bendersky, в таком огромном switch-блоке, как в блоке разбора байткода в CPython
(состоящем из более чем 2000(!) строк), это даёт ускорение порядка 15-20%. Это
происходит по двум причинам: computed goto, в отличие от switch-case, не производит
граничных проверок, необходимых для оператора switch по стандарту C99, и, что,
возможно, более важно, CPU может лучше прогнозировать ветвления в таких ситуациях
&lt;&#x2026;&gt;
</p>
</div>
