www/doc/vm-build.html

<div id="outline-container-sec-3-4-1" class="outline-4">
<h4 id="sec-3-4-1">Компилятор — заклятый друг</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
Однако при измерении скорости интерпретатора, получаемого из threaded.c с флагами
компиляции по умолчанию (программа threaded-notune), я получил неожиданный
результат. Скорость работы программы оказалась на 10%–20% ниже switched. Анализ в VTune
показал, что причина тормозов всё та же — 100% Branch Mispredict на одном из косвенных
переходов внутри DISPATCH
</p>

<p>
Однако что-то здесь не так — для всех остальных DISPATCH вообще нет никакой
статистики. Более того, VTune не показывает для них ассемблерный код. Проверка
дизассемблированием с помощью objdump подтвердила подозрения — во всём теле main() был
только один косвенный переход, связанный c переходом на сервисные процедуры:
</p>

<p>
$ objdump -d threaded-notune| grep 'jmpq\s*\*%rdx'
  4006c8:       ff e2                   jmpq   *%rdx
  400ae7:       ff e2                   jmpq   *%rdx
</p>


<p>
(Второй jmpq по адресу 400ae7 — из функции register<sub>tm</sub><sub>clones</sub>, — не относится к
делу). Что же получается — компилятор GCC в результате процесса оптимизации услужливо
схлопнул все DISPATCH в один, фактически заново построив переключаемый интерпретатор!
</p>

<p>
Тут началась моя борьба с компилятором. Я потратил достаточно много времени, чтобы
заставить GCC генерировать код с независимыми косвенными переходами для каждой
сервисной процедуры.
</p>

<ul class="org-ul">
<li>Проверил разные уровни оптимизации. Правильный код получался только при -Og, уровни
оптимизаций с -O1 по -O3 схлопывали DISPATCH.
Пытался заменить goto на ассемблерную вставку и тем самым спрятать от компилятора
сам факт перехода по метке:
<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">DISPATCH</span>() \
<span style="color: #a020f0;">__asm__</span> __volatile__(<span style="color: #8b2252;">"mov    (%0, %1, 8), %%rcx\n"</span> \
                     <span style="color: #8b2252;">"jmpq   *%%rcx\n"</span> \
                     :: <span style="color: #8b2252;">"r"</span>(&amp;service_routines), <span style="color: #8b2252;">"r"</span>((<span style="color: #228b22;">uint64_t</span>)decoded.opcode):
                     <span style="color: #8b2252;">"%rcx"</span>);
</pre>
</div>
</li>
<li>В этом случае компилятор всё равно объединял похожие блоки кода. При этом все метки
(sr<sub>Add</sub>, sr<sub>Nop</sub> и т.д.) стали указывать в одно и то же место, и все значения в
массиве service<sub>routines</sub> стали одинаковыми. Программа перестала корректно работать.
Попробовал вывести заполнение массива service<sub>routines</sub> из-под контроля компилятора,
чтобы он не смог передвигать метки: сделал содержимое неопределённым и лишь потом
заполнял массив. Игры с неопределённым поведением не могли закончиться хорошо. На
этот раз GCC законно посчитал весь код после первого DISPATCH недостижимым и
полностью удалил его!

<p>
Если ничто другое не помогает, прочтите, наконец, инструкцию.
Аксиома Кана
</p>
</li>
</ul>



<p>
Итак, грубая сила не помогла. Пришлось всё-таки читать документацию и пытаться понять,
какая оптимизация мешает моему замыслу. На третьем экране списка опций оптимизаций я
увидел следующее:
</p>

<p>
Please note the warning under -fgcse about invoking -O2 on programs that use
computed gotos.
&lt;&#x2026;&gt;
Note: When compiling a program using computed gotos, a GCC extension, you may get
better run-time performance if you disable the global common subexpression
elimination pass by adding -fno-gcse to the command line.
</p>



<p>
Попалась! Это оптимизация -fgcse превращала код threaded в ассемблерное
спагетти. Похоже, что с подобной проблемой сталкивались и другие, см. например,
комментарий к посту «Fast interpreter using gcc's computed goto»:
</p>

<p>
I have the same problem as Philip. With G++ the compiler seems to go though
incredible contortions to preserve a single indirect jump. Even going so far as to
combine jumps from separate jump tables — with a series of direct jumps. This seems
utterly bewildering behaviour as it specially breaks the performance gain having a
jmp \*%eax for each interpreter leg.
</p>



<p>
После выяснения вопроса с -fno-gcse генерируемый код стал больше похож на то, что
требовалось:
</p>

<div class="org-src-container">

<pre class="src src-c">$ objdump -d threaded| grep <span style="color: #8b2252;">'jmpq\s*\*%rdx'</span>
4006c8:       ff e2                   jmpq   *%rdx
40070d:       ff e2                   jmpq   *%rdx
40084e:       ff e2                   jmpq   *%rdx
4008bd:       ff e2                   jmpq   *%rdx
40093d:       ff e2                   jmpq   *%rdx
4009b1:       ff e2                   jmpq   *%rdx
400a3b:       ff e2                   jmpq   *%rdx
400aa2:       ff e2                   jmpq   *%rdx
400b15:       ff e2                   jmpq   *%rdx
400b89:       ff e2                   jmpq   *%rdx
400c0b:       ff e2                   jmpq   *%rdx
400c80:       ff e2                   jmpq   *%rdx
400cd8:       ff e2                   jmpq   *%rdx
400d3f:       ff e2                   jmpq   *%rdx
400d90:       ff e2                   jmpq   *%rdx
400dea:       ff e2                   jmpq   *%rdx
400e44:       ff e2                   jmpq   *%rdx
400e8c:       ff e2                   jmpq   *%rdx
400f97:       ff e2                   jmpq   *%rdx
</pre>
</div>

<p>
Ещё раз о том, за счёт чего должно возникнуть ускорение. С помощью реорганизации кода
мы развязали один узел в исполнении всех симулируемых инструкций, заменив его на более
мелкие узлы локальных переходов между парами инструкций. Наверное, эту идею можно
развить и дальше — помочь предсказателю переходов правильно запоминать историю
исполнения троек, четвёрок и т.д. за счёт соответствующего «разбухания» кода. Например,
иметь по две копии всех сервисных процедур, и внутри DISPATCH выбирать только одну из
них, в зависимости от кода предыдущей инструкции и её адреса, или какого-то другого
критерия. Однако оставлю это в качестве упражнения заинтересовавшимся исследователям.
</p>

<p>
После выключения неудачной оптимизации скорость threaded стала получше. Насколько —
описано в конце статьи. А сейчас перейдём к следующему типу интерпретатора.
</p>
</div>
</div>
</div>
