org/doc/vm-build.org
** Процедурный (subroutined)

Но что это я всё про goto и прочие гадости. Пора вспомнить про нормальный и
общепринятый способ организации программ — процедурный механизм (файл
subroutined.c). Оформим код каждой сервисной процедуры в виде функции типа
service_routine_t:

#+BEGIN_SRC c
  typedef void (*service_routine_t)(cpu_t *pcpu, decode_t* pdecode);
#+END_SRC

Пример сервисной процедуры:

#+BEGIN_SRC c
  void sr_Dec(cpu_t *pcpu, decode_t *pdecoded) {
      uint32_t tmp1 = pop(pcpu);
      BAIL_ON_ERROR();
      push(pcpu, tmp1-1);
  }
#+END_SRC

Инициализация массива service_routines теперь использует стандартный оператор взятия
адреса функции:

#+BEGIN_SRC c
  service_routine_t service_routines[] = {
      &sr_Break, &sr_Nop, &sr_Halt, &sr_Push, &sr_Print,
      &sr_Jne, &sr_Swap, &sr_Dup, &sr_Je, &sr_Inc,
      &sr_Add, &sr_Sub, &sr_Mul, &sr_Rand, &sr_Dec,
      &sr_Drop, &sr_Over, &sr_Mod, &sr_Jump
  };
#+END_SRC

Сам главный цикл интерпретации теперь выглядит гораздо более компактно. На каждой его
итерации исполняется функция по адресу, соответствующему опкоду операции.

#+BEGIN_SRC c
  while (cpu.state == Cpu_Running && cpu.steps < steplimit) {
      decode_t decoded = fetch_decode(&cpu);
      if (cpu.state != Cpu_Running) break;
      service_routines[decoded.opcode](&cpu, &decoded); /* Call the SR */
      cpu.pc += decoded.length; /* Advance PC */
      cpu.steps++;
  }
#+END_SRC

Однако анализ в VTune показывает всю ту же проблему — плохое предсказание для переходов
для единственного косвенного перехода при вызове функции

Пока что непонятно, будет ли subroutined работать быстрее switched. Конечно, можно
применить предварительное декодирование — оставлю это в качестве упражнения. Мы же
попытаемся на основе subroutined сделать сшитый интерпретатор. При этом «тот, кто нам
мешает — тот нам поможет!». Я говорю о компиляторе.

** Процедурный с хвостовой рекурсией (tailrecursive)

Прошу читателей обратить внимание на код файла tailrecursive.c. По сравнению с
subroutined.c в нём произошли следующие изменения.
Каждая сервисная процедура теперь заканчивается вызовом fetch_decode() для следующей за
ней инструкции и макросом DISPATCH():

#+BEGIN_SRC c
  void sr_Dec(cpu_t *pcpu, decode_t *pdecoded) {
      uint32_t tmp1 = pop(pcpu);
      BAIL_ON_ERROR();
      push(pcpu, tmp1-1);
      ADVANCE_PC();
      ,*pdecoded = fetch_decode(pcpu);
      DISPATCH();
  }
#+END_SRC

Код макроса DISPATCH:

#+BEGIN_SRC c
  #define DISPATCH() service_routines[pdecoded->opcode](pcpu, pdecoded);
#+END_SRC

То есть каждая процедура в конце вызывают процедуру, эмулирующую следующую инструкцию,
и затем завершается. Код main(), в котором вроде бы должен происходить цикл
интерпретации, выглядит не менее странно:

#+BEGIN_SRC c
  decode_t decoded = fetch_decode(&cpu);
  service_routines[decoded.opcode](&cpu, &decoded);
#+END_SRC

И всё. То есть просто вызывается сервисная процедура для первой гостевой
инструкции. Она же, как мы видели, в конце своей работы вызывает процедуру для
следующей инструкции, та — для третьей…

Но постойте, как это может работать?! Ведь, углубляясь в симуляцию, мы получим растущий
стек вызовов, который вмиг переполнится, и программа упадёт. Однако этого не
происходит.

Причина в том, что переход в вызываемую процедуру происходит перед самым выходом из
вызывающей — так называемый хвостовой вызов. При этом никакого контекста для вызывающей
процедуры хранить не требуется — она фактически завершилась. Поэтому и на стеке
сохранять ничего не обязательно. Достаточно умный компилятор заменит финальный call на
jmp, при этом стек вызовов не увеличится.

В GCC за такую оптимизацию отвечает флаг -foptimize-sibling-calls (включенный, начиная
с -O1). Если её выключить (программа tailrecursive-noopt), то симуляция работает, но
быстро падает. У меня она не добежала до 90000 инструкции:

#+BEGIN_SRC c
  $ ./tailrecursive-noopt 90000 > /dev/null
  Segmentation fault (core dumped)
#+END_SRC

Анализ tailrecursive в VTune показал следующее. Во-первых, верхние места в списке
«горячего» кода заняли fetch(_decode) и decode:

Видимо, дальнейшим шагом должна быть оптимизация (избавление от) декодирования.

Во-вторых, компилятор действительно оптимизировал хвостовые вызовы, заменив call на
jmpq. Например, вот код функции sr_Swap(), вызывающей множество Branch Mispredict:

