www/doc/vm-build.html

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">Процедурный (subroutined)</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Но что это я всё про goto и прочие гадости. Пора вспомнить про нормальный и
общепринятый способ организации программ — процедурный механизм (файл
subroutined.c). Оформим код каждой сервисной процедуры в виде функции типа
service<sub>routine</sub><sub>t</sub>:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">void</span> (*<span style="color: #228b22;">service_routine_t</span>)(<span style="color: #228b22;">cpu_t</span> *<span style="color: #a0522d;">pcpu</span>, <span style="color: #228b22;">decode_t</span>* <span style="color: #a0522d;">pdecode</span>);
</pre>
</div>

<p>
Пример сервисной процедуры:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">sr_Dec</span>(<span style="color: #228b22;">cpu_t</span> *<span style="color: #a0522d;">pcpu</span>, <span style="color: #228b22;">decode_t</span> *<span style="color: #a0522d;">pdecoded</span>) {
    <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">tmp1</span> = pop(pcpu);
    BAIL_ON_ERROR();
    push(pcpu, tmp1-1);
}
</pre>
</div>

<p>
Инициализация массива service<sub>routines</sub> теперь использует стандартный оператор взятия
адреса функции:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">service_routine_t</span> <span style="color: #a0522d;">service_routines</span>[] = {
    &amp;sr_Break, &amp;sr_Nop, &amp;sr_Halt, &amp;sr_Push, &amp;sr_Print,
    &amp;sr_Jne, &amp;sr_Swap, &amp;sr_Dup, &amp;sr_Je, &amp;sr_Inc,
    &amp;sr_Add, &amp;sr_Sub, &amp;sr_Mul, &amp;sr_Rand, &amp;sr_Dec,
    &amp;sr_Drop, &amp;sr_Over, &amp;sr_Mod, &amp;sr_Jump
};
</pre>
</div>

<p>
Сам главный цикл интерпретации теперь выглядит гораздо более компактно. На каждой его
итерации исполняется функция по адресу, соответствующему опкоду операции.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">while</span> (cpu.state == Cpu_Running &amp;&amp; cpu.steps &lt; steplimit) {
    <span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">decoded</span> = fetch_decode(&amp;cpu);
    <span style="color: #a020f0;">if</span> (cpu.state != Cpu_Running) <span style="color: #a020f0;">break</span>;
    service_routines[decoded.opcode](&amp;cpu, &amp;decoded); <span style="color: #b22222;">/* </span><span style="color: #b22222;">Call the SR </span><span style="color: #b22222;">*/</span>
    cpu.pc += decoded.length; <span style="color: #b22222;">/* </span><span style="color: #b22222;">Advance PC </span><span style="color: #b22222;">*/</span>
    cpu.steps++;
}
</pre>
</div>

<p>
Однако анализ в VTune показывает всю ту же проблему — плохое предсказание для переходов
для единственного косвенного перехода при вызове функции
</p>

<p>
Пока что непонятно, будет ли subroutined работать быстрее switched. Конечно, можно
применить предварительное декодирование — оставлю это в качестве упражнения. Мы же
попытаемся на основе subroutined сделать сшитый интерпретатор. При этом «тот, кто нам
мешает — тот нам поможет!». Я говорю о компиляторе.
</p>
</div>
</div>

<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6">Процедурный с хвостовой рекурсией (tailrecursive)</h3>
<div class="outline-text-3" id="text-3-6">
<p>
Прошу читателей обратить внимание на код файла tailrecursive.c. По сравнению с
subroutined.c в нём произошли следующие изменения.
Каждая сервисная процедура теперь заканчивается вызовом fetch<sub>decode</sub>() для следующей за
ней инструкции и макросом DISPATCH():
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">sr_Dec</span>(<span style="color: #228b22;">cpu_t</span> *<span style="color: #a0522d;">pcpu</span>, <span style="color: #228b22;">decode_t</span> *<span style="color: #a0522d;">pdecoded</span>) {
    <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">tmp1</span> = pop(pcpu);
    BAIL_ON_ERROR();
    push(pcpu, tmp1-1);
    ADVANCE_PC();
    *pdecoded = fetch_decode(pcpu);
    DISPATCH();
}
</pre>
</div>

<p>
Код макроса DISPATCH:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">DISPATCH</span>() service_routines[pdecoded-&gt;opcode](pcpu, pdecoded);
</pre>
</div>

<p>
То есть каждая процедура в конце вызывают процедуру, эмулирующую следующую инструкцию,
и затем завершается. Код main(), в котором вроде бы должен происходить цикл
интерпретации, выглядит не менее странно:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">decoded</span> = fetch_decode(&amp;cpu);
service_routines[decoded.opcode](&amp;cpu, &amp;decoded);
</pre>
</div>

<p>
И всё. То есть просто вызывается сервисная процедура для первой гостевой
инструкции. Она же, как мы видели, в конце своей работы вызывает процедуру для
следующей инструкции, та — для третьей…
</p>

<p>
Но постойте, как это может работать?! Ведь, углубляясь в симуляцию, мы получим растущий
стек вызовов, который вмиг переполнится, и программа упадёт. Однако этого не
происходит.
</p>

<p>
Причина в том, что переход в вызываемую процедуру происходит перед самым выходом из
вызывающей — так называемый хвостовой вызов. При этом никакого контекста для вызывающей
процедуры хранить не требуется — она фактически завершилась. Поэтому и на стеке
сохранять ничего не обязательно. Достаточно умный компилятор заменит финальный call на
jmp, при этом стек вызовов не увеличится.
</p>

<p>
В GCC за такую оптимизацию отвечает флаг -foptimize-sibling-calls (включенный, начиная
с -O1). Если её выключить (программа tailrecursive-noopt), то симуляция работает, но
быстро падает. У меня она не добежала до 90000 инструкции:
</p>

<div class="org-src-container">

<pre class="src src-c">$ ./tailrecursive-noopt 90000 &gt; /dev/null
Segmentation fault (<span style="color: #228b22;">core</span> <span style="color: #a0522d;">dumped</span>)
</pre>
</div>

<p>
Анализ tailrecursive в VTune показал следующее. Во-первых, верхние места в списке
«горячего» кода заняли fetch(<sub>decode</sub>) и decode:
</p>

<p>
Видимо, дальнейшим шагом должна быть оптимизация (избавление от) декодирования.
</p>

<p>
Во-вторых, компилятор действительно оптимизировал хвостовые вызовы, заменив call на
jmpq. Например, вот код функции sr<sub>Swap</sub>(), вызывающей множество Branch Mispredict:
</p>
</div>
</div>
