org/doc/vm-build.org
** Рудиментарный двоичный транслятор (binary translation)

Для тех отважных читателей, что добрались до этого места, я подготовил ещё одну
реализацию ВМ (файл translated.c). Формально эта программа не относится к классу
интерпретаторов: в ней присутствует генерация машинного кода, соответствующего входной
гостевой программе (трансляция). Однако, как мы увидим, translated недалеко ушла от
интерпретаторов. Так, в ней тоже присутствует фаза предварительного декодирования, а
исполнение, как и в шитом коде, прыгает от одной сервисной процедуры к другой.

Есть и важное отличие. Весь приведённый ранее код — это Си, и он может быть
скомпилирован и запущен на любой POSIX-платформе.

translated же явно завязан на хозяйскую архитектуру Intel 64 (x86_64, AMD64, x64...), и
не заработает ни на какой другой. Потребуется существенная модификация функции
translate_program() и ещё нескольких мест.

Этот транслятор «рудиментарный», так как его автор поленился сделать капсулы
по-человечески. Он служит лишь иллюстративным целям. Я описал два способа построения
двоичных трансляторов в этой статье: http://habrahabr.ru/company/intel/blog/254027/

Разберём самые важные места в коде программы.

#+BEGIN_SRC c
  #ifndef __x86_64__
  /* The program generates machine code, only specific platforms are supported */
  #error This program is designed to compile only on Intel64/AMD64 platform.
  #error Sorry.
  #endif
#+END_SRC

Прибиваем гвоздями pcpu к R15

#+BEGIN_SRC c
  /* Global pointer to be accessible from generated code.
     Uses GNU extension to statically occupy host R15 register. */
  register cpu_t * pcpu asm("r15");
#+END_SRC

Для ускорения доступа к самой часто используемой структуре cpu_t, хранящей
архитектурное состояние моделируемого процессора, статически выделяется хозяйский
регистр R15. Для этого используется нестандартное GNU-расширение, и поэтому программа
компилируется с флагом -std=gnu11 (смотри Makefile), тогда как все остальные — с флагом
-std=c11.

Область для генерированного кода

#+BEGIN_SRC c
  char gen_code[JIT_CODE_SIZE] __attribute__ ((section (".text#")))
      __attribute__ ((aligned(4096)));
#+END_SRC

Массив gen_code получил два атрибута. Во-первых, адрес его начала должен быть выровнен
на размер страницы. Во-вторых, я размещаю его в секции кода (.text), а не в секции
данных (.data), где вообще-то место нормальным переменным. Поскольку мы будем в него
писать код, лучше, чтобы он был поближе к остальному коду программы. Однако писать в
gen_code пока что нельзя — секция .text по умолчанию защищена от записи.

Вход и выход из сгенерированного кода

#+BEGIN_SRC c
  static void enter_generated_code(void* addr) {
      __asm__ __volatile__ ( "jmp *%0"::"r"(addr):);
  }

  static void exit_generated_code() {
      longjmp(return_buf, 1);
  }
#+END_SRC

Вход в транслированный код происходит простым прыжком на начало требуемого блока внутри
массива gen_code. Выход сделан через longjmp() — определённый в стандарте Си механизм
нелокального goto (как будто обычного goto было мало). Эта штука позволяет выпрыгнуть
из функции в любую другую из цепочки вызвавших её, в место, помеченное с помощью
setjmp() c тем же значением аргумента (return_buf).

Данный механизм довольно полезен при написании двоичного транслятора, так как упрощает
логику обработки исключительных ситуаций. exit_generated_code() вызывается всюду в
коде, где необходимо сигнализировать о переходе в состояния Halted/Break, а также при
нелинейном изменении PC. Признаться, я, похоже, хватил лишнего — разбросал longjmp по
всему коду.

Код сервисных процедур

#+BEGIN_SRC c
  void sr_Drop() {
      (void)pop(pcpu);
      ADVANCE_PC(1);
  }

  void sr_Je(int32_t immediate) {
      uint32_t tmp1 = pop(pcpu);
      if (tmp1 == 0)
          pcpu->pc += immediate;
      ADVANCE_PC(2);
      if (tmp1 == 0) /* Non-sequential PC change */
          exit_generated_code();
  }
#+END_SRC

Процедуры для инструкций ВМ, не имеющих операнда (например, Drop), оперируют только
глобально определённым pcpu. Процедуры для инструкций с операндом (например, Je)
получают его в первом аргументе. Если сгенерированный код будет вызывать их, то он
должен соблюдать ABI хозяйской системы. В случае System V ABI (используемого в Linux)
первый аргумент — это регистр RDI.

Код translate_program()

#+BEGIN_SRC c
  static void translate_program(const Instr_t *prog,
                                char *out_code, void **entrypoints, int len) {
      assert(prog);
      assert(out_code);
      assert(entrypoints);

      /* An IA-32 instruction "MOV RDI, imm32" is used to pass a parameter
         to a function invoked by a following CALL. */
  #ifdef __CYGWIN__ /* Win64 ABI, use RCX instead of RDI */
      const char mov_template_code[]= {0x48, 0xc7, 0xc1, 0x00, 0x00, 0x00, 0x00};
      #else
      const char mov_template_code[]= {0x48, 0xc7, 0xc7, 0x00, 0x00, 0x00, 0x00};
      #endif
      const int mov_template_size = sizeof(mov_template_code);

      /* An IA-32 instruction "CALL rel32" is used as a trampoline to invoke
         service routines. A template for it is "call .+0x00000005" */
      const char call_template_code[] = { 0xe8, 0x00, 0x00, 0x00, 0x00 };
      const int call_template_size = sizeof(call_template_code);

      int i = 0; /* Address of current guest instruction */
      char* cur = out_code; /* Where to put new code */

      /* The program is short, so we can translate it as a whole.
         Otherwise, some sort of lazy decoding will be required */
      while (i < len) {
          decode_t decoded = decode_at_address(prog, i);
          entrypoints[i] = (void*) cur;

          if (decoded.length == 2) { /* Guest instruction has an immediate */
              assert(cur + mov_template_size - out_code < JIT_CODE_SIZE);
              memcpy(cur, mov_template_code, mov_template_size);
              /* Patch template with correct immediate value */
              memcpy(cur + 3, &decoded.immediate, 4);
              cur += mov_template_size;
          }

          assert(cur + call_template_size - out_code < JIT_CODE_SIZE);
          memcpy(cur, call_template_code, call_template_size);
          intptr_t offset = (intptr_t)service_routines[decoded.opcode]
              - (intptr_t)cur - call_template_size;
          if (offset != (intptr_t)(int32_t)offset) {
              fprintf(stderr, "Offset to service routine for opcode %d"
                      " does not fit in 32 bits. Cannot generate code for it, sorry",
                      decoded.opcode);
              exit(2);
          }
          uint32_t offset32 = (uint32_t)offset;
          /* Patch template with correct offset */
          memcpy(cur + 1, &offset, 4);
          i += decoded.length;
          cur += call_template_size;
      }
  }
#+END_SRC

Самый сложный блок программы требует подробного рассмотрения. В результате работы этой
функции по содержимому гостевой программы prog длиной len должны быть заполнены два
массива: out_code — хозяйским гостевым кодом, симулирующим последовательность
инструкций из prog, и массив указателей entrypoints на начала индивидуальных капсул
внутри out_code.

Каждая гостевая инструкция декодируется, после чего транслируется в одну или две
хозяйских инструкции. Для гостевых инструкций без операндов это «call rel32», для
инструкций с операндом — пара «mov imm, %rdi; call rel32». RDI здесь, потому что
вызываемые процедуры ожидают увидеть в нём свой аргумент.

rel32 — это 32-битное смещение адреса вызываемой функции по отношению к текущей
инструкции. Для каждой новой инструкции CALL оно разное, поэтому оно каждый раз
высчитывается (offset32) относительно текущего положения.

Почему я использовал здесь относительные адреса, а не абсолютные? Потому что хозяйская
система использует 64-битные адреса, и для передачи 64 бит в CALL потребовалась бы ещё
одна инструкция и ещё один регистр. Из-за этого gen_code размещён в секции кода — чтобы
все смещения умещались в 32 бита. Ведь секция данных может быть помещена очень далеко
от кода.

Заметьте, что как код шаблонов (mov_template_code и call_template_code), так и
последующие манипуляции с ними (вызовы memcpy()) зависят способа кодирования хозяйских
инструкций. При портировании translated на другую архитектуру их придётся исправить в
первую очередь.

Результат трансляции программы Primes, полученный с помощью GDB в момент окончания
работы translate_program():

Хозяйский код для Primes

#+BEGIN_SRC c
  (gdb) disassemble gen_code, gen_code+4096
      Dump of assembler code from 0x403000 to 0x404000:
      0x0000000000403000 <gen_code+0>:     mov    $0x186a0,%rdi
      0x0000000000403007 <gen_code+7>:     callq  0x4020c0 <sr_Push>
      0x000000000040300c <gen_code+12>:    mov    $0x2,%rdi
      0x0000000000403013 <gen_code+19>:    callq  0x4020c0 <sr_Push>
      0x0000000000403018 <gen_code+24>:    callq  0x4029a0 <sr_Over>
      0x000000000040301d <gen_code+29>:    callq  0x4029a0 <sr_Over>
      0x0000000000403022 <gen_code+34>:    callq  0x402720 <sr_Sub>
      0x0000000000403027 <gen_code+39>:    mov    $0x17,%rdi
      0x000000000040302e <gen_code+46>:    callq  0x4021a0 <sr_Je>
      0x0000000000403033 <gen_code+51>:    mov    $0x2,%rdi
      0x000000000040303a <gen_code+58>:    callq  0x4020c0 <sr_Push>
      0x000000000040303f <gen_code+63>:    callq  0x4029a0 <sr_Over>
      0x0000000000403044 <gen_code+68>:    callq  0x4029a0 <sr_Over>
      0x0000000000403049 <gen_code+73>:    callq  0x4027e0 <sr_Swap>
      0x000000000040304e <gen_code+78>:    callq  0x402720 <sr_Sub>
      0x0000000000403053 <gen_code+83>:    mov    $0x9,%rdi
      0x000000000040305a <gen_code+90>:    callq  0x4021a0 <sr_Je>
      0x000000000040305f <gen_code+95>:    callq  0x4029a0 <sr_Over>
      0x0000000000403064 <gen_code+100>:   callq  0x4029a0 <sr_Over>
      0x0000000000403069 <gen_code+105>:   callq  0x4027e0 <sr_Swap>
      0x000000000040306e <gen_code+110>:   callq  0x4028c0 <sr_Mod>
      0x0000000000403073 <gen_code+115>:   mov    $0x5,%rdi
      0x000000000040307a <gen_code+122>:   callq  0x4021a0 <sr_Je>
      0x000000000040307f <gen_code+127>:   callq  0x402300 <sr_Inc>
      0x0000000000403084 <gen_code+132>:   mov    $0xfffffffffffffff1,%rdi
      0x000000000040308b <gen_code+139>:   callq  0x402080 <sr_Jump>
      0x0000000000403090 <gen_code+144>:   callq  0x4029a0 <sr_Over>
      0x0000000000403095 <gen_code+149>:   callq  0x402460 <sr_Print>
      0x000000000040309a <gen_code+154>:   callq  0x4022a0 <sr_Drop>
      0x000000000040309f <gen_code+159>:   callq  0x402300 <sr_Inc>
      0x00000000004030a4 <gen_code+164>:   mov    $0xffffffffffffffe4,%rdi
      0x00000000004030ab <gen_code+171>:   callq  0x402080 <sr_Jump>
      0x00000000004030b0 <gen_code+176>:   callq  0x402060 <sr_Halt>
      0x00000000004030b5 <gen_code+181>:   callq  0x4020a0 <sr_Break>
      0x00000000004030ba <gen_code+186>:   callq  0x4020a0 <sr_Break>
      0x00000000004030bf <gen_code+191>:   callq  0x4020a0 <sr_Break>
      0x00000000004030c4 <gen_code+196>:   callq  0x4020a0 <sr_Break>
      0x00000000004030c9 <gen_code+201>:   callq  0x4020a0 <sr_Break>
      0x00000000004030ce <gen_code+206>:   callq  0x4020a0 <sr_Break>
      <...>
#+END_SRC

Ещё раз отмечу: на момент начала работы translated этого кода не существовало.
Конечно, вместо того, чтобы без конца их вызывать, правильнее было бы подставить тела
самих сервисных процедур в out_code. При этом было бы сэкономлено время на входах и
выходах в функции. Но пришлось бы что-то делать с прологами-эпилогами процедур,
т.е. учиться инлайнить код за спиной у компилятора. Я оставлю это упражнение читателям,
желающим поглубже разобраться с вопросами кодогенерации.

Наконец, изучим происходящее в main() внутри translate:

#+BEGIN_SRC c
  /* Code section is protected from writes by default, un-protect it */
  if (mprotect(gen_code, JIT_CODE_SIZE, PROT_READ | PROT_WRITE | PROT_EXEC)) {
      perror("mprotect");
      exit(2);
  }
  /* Pre-populate resulting code buffer with INT3 (machine code 0xCC).
     This will help to catch jumps to wrong locations */
  memset(gen_code, 0xcc, JIT_CODE_SIZE);
  void* entrypoints[PROGRAM_SIZE] = {0}; /* a map of guest PCs to capsules */

  translate_program(cpu.pmem, gen_code, entrypoints, PROGRAM_SIZE);

  setjmp(return_buf); /* Will get here from generated code. */

  while (cpu.state == Cpu_Running && cpu.steps < steplimit) {
      if (cpu.pc > PROGRAM_SIZE) {
          cpu.state = Cpu_Break;
          break;
      }
      enter_generated_code(entrypoints[cpu.pc]); /* Will not return */
  }
#+END_SRC

Во-первых, обязательно необходимо разрешить запись в gen_code. Это делается с помощью
системного вызова mprotect(). Затем на всякий случай заполним gen_code целиком
однобайтовой инструкцией INT3 — 0xcc. Если при исполнении сгенерированного кода что-то
пойдёт не так, и управление передадут на незаполненный участок массива, сразу
произойдёт прерывание, что облегчит отладку.
Затем транслируем программу и устанавливаем точку возврата с помощью setjmp(). Именно
сюда, на начало цикла while(), будет возвращаться исполнение.

Цикл while каждый раз будет передавать управление, используя в качестве адреса значения
из отображения entrypoints для текущего PC. Возможно, возник вопрос — а зачем вообще
выходить из gen_code до окончания работы сгенерированного кода?

Обратите своё внимание ещё раз на листинг gen_code выше. В нём нет ни одной инструкции
ветвления — все MOV и CALL исполнятся последовательно. Однако в исходной программе были
циклы!
Трансляция гостевых инструкций переходов — это сложный момент: смещения адресов
гостевого кода в общем случае нелинейным образом связаны со смещениями между капсулами
кода хозяйского. Я обошёл эту сложность, используя следующий трюк. Все сервисные
процедуры, изменившие PC нелинейным образом (т.е. Jump, JE, JNE), обязаны вызывать
exit_generated_code(). И уже внешний код, используя сохранённые значения в entrypoints,
заново зайдёт в гостевой код по правильному адресу. Для остальных, «обычных» сервисных
процедур, longjmp не нужен — они просто проваливаются на следующую по коду процедуру.

У меня есть идея, как обойтись без longjmp внутри процедур для JNE, JE и Jump. Можно
узнать следующую точку входа из entrypoints сразу внутри процедуры, и поместить
дополнительное значение адреса возврата RIP на стеке так, чтобы при выходе из текущей
процедуры оказаться не в вызывавшей её функции, а сразу в нужной процедуре! Ещё одно
упражнение для пытливого читателя — реализовать эту идею.

Узкие места изменились. Теперь VTune обозначил главной проблемой «Front End Bound».
В верх списка попали сервисные процедуры, что можно в некоторой мере считать
успехом.

Сравниваемые варианты программ.

    switched — переключаемый интерпретатор.
    threaded — шитый интерпретатор.
    predecoded — переключаемый интерпретатор с предварительным декодированием.
    subroutined — процедурный интерпретатор.
    threaded-cached — шитый с предварительным декодированием интерпретатор.
    tailrecursive — процедурный интерпретатор с оптимизированными хвостовыми вызовами.
    translated — двоичный транслятор.
    native — реализация алгоритма Primes на Си. Не совсем честно сравнивать статичную
    программу с реализациями ВМ, способной исполнить произвольный код. Тем не менее, в
    сравнении native участвует, чтобы показать потенциал к возможному ускорению.

По результатам бенчмарков predecoded работает лишь чуть быстрее switched. По
непонятным мне причинам простой threaded так и остался медленнее switched. А вот
сочетание предварительного декодирования с шитым кодом, threaded-cached, дало заметный
прирост. Удивительно хорошо показали себя процедурный интерпретатор subroutined и
процедурный с хвостовыми оптимизациями tailrecursive. Ожидаемо было и то, что
translated обошёл все интерпретаторы.

