www/doc/vm-build.html

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7">Рудиментарный двоичный транслятор (binary translation)</h3>
<div class="outline-text-3" id="text-3-7">
<p>
Для тех отважных читателей, что добрались до этого места, я подготовил ещё одну
реализацию ВМ (файл translated.c). Формально эта программа не относится к классу
интерпретаторов: в ней присутствует генерация машинного кода, соответствующего входной
гостевой программе (трансляция). Однако, как мы увидим, translated недалеко ушла от
интерпретаторов. Так, в ней тоже присутствует фаза предварительного декодирования, а
исполнение, как и в шитом коде, прыгает от одной сервисной процедуры к другой.
</p>

<p>
Есть и важное отличие. Весь приведённый ранее код — это Си, и он может быть
скомпилирован и запущен на любой POSIX-платформе.
</p>

<p>
translated же явно завязан на хозяйскую архитектуру Intel 64 (x86<sub>64</sub>, AMD64, x64&#x2026;), и
не заработает ни на какой другой. Потребуется существенная модификация функции
translate<sub>program</sub>() и ещё нескольких мест.
</p>

<p>
Этот транслятор «рудиментарный», так как его автор поленился сделать капсулы
по-человечески. Он служит лишь иллюстративным целям. Я описал два способа построения
двоичных трансляторов в этой статье: <a href="http://habrahabr.ru/company/intel/blog/254027/">http://habrahabr.ru/company/intel/blog/254027/</a>
</p>

<p>
Разберём самые важные места в коде программы.
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> __x86_64__
<span style="color: #b22222;">/* </span><span style="color: #b22222;">The program generates machine code, only specific platforms are supported </span><span style="color: #b22222;">*/</span>
<span style="color: #483d8b;">#error</span> <span style="color: #8b2252;">This program is designed to compile only on Intel64/AMD64 platform.</span>
<span style="color: #483d8b;">#error</span> <span style="color: #8b2252;">Sorry.</span>
<span style="color: #483d8b;">#endif</span>
</pre>
</div>

<p>
Прибиваем гвоздями pcpu к R15
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">/* </span><span style="color: #b22222;">Global pointer to be accessible from generated code.</span>
<span style="color: #b22222;">   Uses GNU extension to statically occupy host R15 register. </span><span style="color: #b22222;">*/</span>
<span style="color: #a020f0;">register</span> <span style="color: #228b22;">cpu_t</span> * <span style="color: #0000ff;">pcpu</span> <span style="color: #a020f0;">asm</span>(<span style="color: #8b2252;">"r15"</span>);
</pre>
</div>

<p>
Для ускорения доступа к самой часто используемой структуре cpu<sub>t</sub>, хранящей
архитектурное состояние моделируемого процессора, статически выделяется хозяйский
регистр R15. Для этого используется нестандартное GNU-расширение, и поэтому программа
компилируется с флагом -std=gnu11 (смотри Makefile), тогда как все остальные — с флагом
-std=c11.
</p>

<p>
Область для генерированного кода
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">char</span> <span style="color: #a0522d;">gen_code</span>[JIT_CODE_SIZE] <span style="color: #a020f0;">__attribute__</span> ((section (<span style="color: #8b2252;">".text#"</span>)))
    <span style="color: #a020f0;">__attribute__</span> ((aligned(4096)));
</pre>
</div>

<p>
Массив gen<sub>code</sub> получил два атрибута. Во-первых, адрес его начала должен быть выровнен
на размер страницы. Во-вторых, я размещаю его в секции кода (.text), а не в секции
данных (.data), где вообще-то место нормальным переменным. Поскольку мы будем в него
писать код, лучше, чтобы он был поближе к остальному коду программы. Однако писать в
gen<sub>code</sub> пока что нельзя — секция .text по умолчанию защищена от записи.
</p>

<p>
Вход и выход из сгенерированного кода
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">enter_generated_code</span>(<span style="color: #228b22;">void</span>* <span style="color: #a0522d;">addr</span>) {
    <span style="color: #a020f0;">__asm__</span> __volatile__ ( <span style="color: #8b2252;">"jmp *%0"</span>::<span style="color: #8b2252;">"r"</span>(addr):);
}

<span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">exit_generated_code</span>() {
    longjmp(return_buf, 1);
}
</pre>
</div>

<p>
Вход в транслированный код происходит простым прыжком на начало требуемого блока внутри
массива gen<sub>code</sub>. Выход сделан через longjmp() — определённый в стандарте Си механизм
нелокального goto (как будто обычного goto было мало). Эта штука позволяет выпрыгнуть
из функции в любую другую из цепочки вызвавших её, в место, помеченное с помощью
setjmp() c тем же значением аргумента (return<sub>buf</sub>).
</p>

<p>
Данный механизм довольно полезен при написании двоичного транслятора, так как упрощает
логику обработки исключительных ситуаций. exit<sub>generated</sub><sub>code</sub>() вызывается всюду в
коде, где необходимо сигнализировать о переходе в состояния Halted/Break, а также при
нелинейном изменении PC. Признаться, я, похоже, хватил лишнего — разбросал longjmp по
всему коду.
</p>

<p>
Код сервисных процедур
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">sr_Drop</span>() {
    (<span style="color: #228b22;">void</span>)pop(pcpu);
    ADVANCE_PC(1);
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">sr_Je</span>(<span style="color: #228b22;">int32_t</span> <span style="color: #a0522d;">immediate</span>) {
    <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">tmp1</span> = pop(pcpu);
    <span style="color: #a020f0;">if</span> (tmp1 == 0)
        pcpu-&gt;pc += immediate;
    ADVANCE_PC(2);
    <span style="color: #a020f0;">if</span> (tmp1 == 0) <span style="color: #b22222;">/* </span><span style="color: #b22222;">Non-sequential PC change </span><span style="color: #b22222;">*/</span>
        exit_generated_code();
}
</pre>
</div>

<p>
Процедуры для инструкций ВМ, не имеющих операнда (например, Drop), оперируют только
глобально определённым pcpu. Процедуры для инструкций с операндом (например, Je)
получают его в первом аргументе. Если сгенерированный код будет вызывать их, то он
должен соблюдать ABI хозяйской системы. В случае System V ABI (используемого в Linux)
первый аргумент — это регистр RDI.
</p>

<p>
Код translate<sub>program</sub>()
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">translate_program</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">Instr_t</span> *<span style="color: #a0522d;">prog</span>,
                              <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">out_code</span>, <span style="color: #228b22;">void</span> **<span style="color: #a0522d;">entrypoints</span>, <span style="color: #228b22;">int</span> <span style="color: #a0522d;">len</span>) {
    assert(prog);
    assert(out_code);
    assert(entrypoints);

    <span style="color: #b22222;">/* </span><span style="color: #b22222;">An IA-32 instruction "MOV RDI, imm32" is used to pass a parameter</span>
<span style="color: #b22222;">       to a function invoked by a following CALL. </span><span style="color: #b22222;">*/</span>
<span style="color: #483d8b;">#ifdef</span> __CYGWIN__ <span style="color: #b22222;">/* </span><span style="color: #b22222;">Win64 ABI, use RCX instead of RDI </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">mov_template_code</span>[]= {0x48, 0xc7, 0xc1, 0x00, 0x00, 0x00, 0x00};
<span style="color: #483d8b;">    #else</span>
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">mov_template_code</span>[]= {0x48, 0xc7, 0xc7, 0x00, 0x00, 0x00, 0x00};
<span style="color: #483d8b;">    #endif</span>
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">mov_template_size</span> = <span style="color: #a020f0;">sizeof</span>(mov_template_code);

    <span style="color: #b22222;">/* </span><span style="color: #b22222;">An IA-32 instruction "CALL rel32" is used as a trampoline to invoke</span>
<span style="color: #b22222;">       service routines. A template for it is "call .+0x00000005" </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span> <span style="color: #a0522d;">call_template_code</span>[] = { 0xe8, 0x00, 0x00, 0x00, 0x00 };
    <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">call_template_size</span> = <span style="color: #a020f0;">sizeof</span>(call_template_code);

    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; <span style="color: #b22222;">/* </span><span style="color: #b22222;">Address of current guest instruction </span><span style="color: #b22222;">*/</span>
    <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">cur</span> = out_code; <span style="color: #b22222;">/* </span><span style="color: #b22222;">Where to put new code </span><span style="color: #b22222;">*/</span>

    <span style="color: #b22222;">/* </span><span style="color: #b22222;">The program is short, so we can translate it as a whole.</span>
<span style="color: #b22222;">       Otherwise, some sort of lazy decoding will be required </span><span style="color: #b22222;">*/</span>
    <span style="color: #a020f0;">while</span> (i &lt; len) {
        <span style="color: #228b22;">decode_t</span> <span style="color: #a0522d;">decoded</span> = decode_at_address(prog, i);
        entrypoints[i] = (<span style="color: #228b22;">void</span>*) cur;

        <span style="color: #a020f0;">if</span> (decoded.length == 2) { <span style="color: #b22222;">/* </span><span style="color: #b22222;">Guest instruction has an immediate </span><span style="color: #b22222;">*/</span>
            assert(cur + mov_template_size - out_code &lt; JIT_CODE_SIZE);
            memcpy(cur, mov_template_code, mov_template_size);
            <span style="color: #b22222;">/* </span><span style="color: #b22222;">Patch template with correct immediate value </span><span style="color: #b22222;">*/</span>
            memcpy(cur + 3, &amp;decoded.immediate, 4);
            cur += mov_template_size;
        }

        assert(cur + call_template_size - out_code &lt; JIT_CODE_SIZE);
        memcpy(cur, call_template_code, call_template_size);
        <span style="color: #228b22;">intptr_t</span> <span style="color: #a0522d;">offset</span> = (<span style="color: #228b22;">intptr_t</span>)service_routines[decoded.opcode]
            - (<span style="color: #228b22;">intptr_t</span>)cur - call_template_size;
        <span style="color: #a020f0;">if</span> (offset != (<span style="color: #228b22;">intptr_t</span>)(<span style="color: #228b22;">int32_t</span>)offset) {
            fprintf(stderr, <span style="color: #8b2252;">"Offset to service routine for opcode %d"</span>
                    <span style="color: #8b2252;">" does not fit in 32 bits. Cannot generate code for it, sorry"</span>,
                    decoded.opcode);
            exit(2);
        }
        <span style="color: #228b22;">uint32_t</span> <span style="color: #a0522d;">offset32</span> = (<span style="color: #228b22;">uint32_t</span>)offset;
        <span style="color: #b22222;">/* </span><span style="color: #b22222;">Patch template with correct offset </span><span style="color: #b22222;">*/</span>
        memcpy(cur + 1, &amp;offset, 4);
        i += decoded.length;
        cur += call_template_size;
    }
}
</pre>
</div>

<p>
Самый сложный блок программы требует подробного рассмотрения. В результате работы этой
функции по содержимому гостевой программы prog длиной len должны быть заполнены два
массива: out<sub>code</sub> — хозяйским гостевым кодом, симулирующим последовательность
инструкций из prog, и массив указателей entrypoints на начала индивидуальных капсул
внутри out<sub>code</sub>.
</p>

<p>
Каждая гостевая инструкция декодируется, после чего транслируется в одну или две
хозяйских инструкции. Для гостевых инструкций без операндов это «call rel32», для
инструкций с операндом — пара «mov imm, %rdi; call rel32». RDI здесь, потому что
вызываемые процедуры ожидают увидеть в нём свой аргумент.
</p>

<p>
rel32 — это 32-битное смещение адреса вызываемой функции по отношению к текущей
инструкции. Для каждой новой инструкции CALL оно разное, поэтому оно каждый раз
высчитывается (offset32) относительно текущего положения.
</p>

<p>
Почему я использовал здесь относительные адреса, а не абсолютные? Потому что хозяйская
система использует 64-битные адреса, и для передачи 64 бит в CALL потребовалась бы ещё
одна инструкция и ещё один регистр. Из-за этого gen<sub>code</sub> размещён в секции кода — чтобы
все смещения умещались в 32 бита. Ведь секция данных может быть помещена очень далеко
от кода.
</p>

<p>
Заметьте, что как код шаблонов (mov<sub>template</sub><sub>code</sub> и call<sub>template</sub><sub>code</sub>), так и
последующие манипуляции с ними (вызовы memcpy()) зависят способа кодирования хозяйских
инструкций. При портировании translated на другую архитектуру их придётся исправить в
первую очередь.
</p>

<p>
Результат трансляции программы Primes, полученный с помощью GDB в момент окончания
работы translate<sub>program</sub>():
</p>

<p>
Хозяйский код для Primes
</p>

<div class="org-src-container">

<pre class="src src-c">(<span style="color: #228b22;">gdb</span>) <span style="color: #228b22;">disassemble</span> <span style="color: #a0522d;">gen_code</span>, <span style="color: #a0522d;">gen_code</span>+4096
    Dump of assembler code from 0x403000 to 0x404000:
    0x0000000000403000 &lt;gen_code+0&gt;:     mov    $0x186a0,%rdi
    0x0000000000403007 &lt;gen_code+7&gt;:     callq  0x4020c0 &lt;sr_Push&gt;
    0x000000000040300c &lt;gen_code+12&gt;:    mov    $0x2,%rdi
    0x0000000000403013 &lt;gen_code+19&gt;:    callq  0x4020c0 &lt;sr_Push&gt;
    0x0000000000403018 &lt;gen_code+24&gt;:    callq  0x4029a0 &lt;sr_Over&gt;
    0x000000000040301d &lt;gen_code+29&gt;:    callq  0x4029a0 &lt;sr_Over&gt;
    0x0000000000403022 &lt;gen_code+34&gt;:    callq  0x402720 &lt;sr_Sub&gt;
    0x0000000000403027 &lt;gen_code+39&gt;:    mov    $0x17,%rdi
    0x000000000040302e &lt;gen_code+46&gt;:    callq  0x4021a0 &lt;sr_Je&gt;
    0x0000000000403033 &lt;gen_code+51&gt;:    mov    $0x2,%rdi
    0x000000000040303a &lt;gen_code+58&gt;:    callq  0x4020c0 &lt;sr_Push&gt;
    0x000000000040303f &lt;gen_code+63&gt;:    callq  0x4029a0 &lt;sr_Over&gt;
    0x0000000000403044 &lt;gen_code+68&gt;:    callq  0x4029a0 &lt;sr_Over&gt;
    0x0000000000403049 &lt;gen_code+73&gt;:    callq  0x4027e0 &lt;sr_Swap&gt;
    0x000000000040304e &lt;gen_code+78&gt;:    callq  0x402720 &lt;sr_Sub&gt;
    0x0000000000403053 &lt;gen_code+83&gt;:    mov    $0x9,%rdi
    0x000000000040305a &lt;gen_code+90&gt;:    callq  0x4021a0 &lt;sr_Je&gt;
    0x000000000040305f &lt;gen_code+95&gt;:    callq  0x4029a0 &lt;sr_Over&gt;
    0x0000000000403064 &lt;gen_code+100&gt;:   callq  0x4029a0 &lt;sr_Over&gt;
    0x0000000000403069 &lt;gen_code+105&gt;:   callq  0x4027e0 &lt;sr_Swap&gt;
    0x000000000040306e &lt;gen_code+110&gt;:   callq  0x4028c0 &lt;sr_Mod&gt;
    0x0000000000403073 &lt;gen_code+115&gt;:   mov    $0x5,%rdi
    0x000000000040307a &lt;gen_code+122&gt;:   callq  0x4021a0 &lt;sr_Je&gt;
    0x000000000040307f &lt;gen_code+127&gt;:   callq  0x402300 &lt;sr_Inc&gt;
    0x0000000000403084 &lt;gen_code+132&gt;:   mov    $0xfffffffffffffff1,%rdi
    0x000000000040308b &lt;gen_code+139&gt;:   callq  0x402080 &lt;sr_Jump&gt;
    0x0000000000403090 &lt;gen_code+144&gt;:   callq  0x4029a0 &lt;sr_Over&gt;
    0x0000000000403095 &lt;gen_code+149&gt;:   callq  0x402460 &lt;sr_Print&gt;
    0x000000000040309a &lt;gen_code+154&gt;:   callq  0x4022a0 &lt;sr_Drop&gt;
    0x000000000040309f &lt;gen_code+159&gt;:   callq  0x402300 &lt;sr_Inc&gt;
    0x00000000004030a4 &lt;gen_code+164&gt;:   mov    $0xffffffffffffffe4,%rdi
    0x00000000004030ab &lt;gen_code+171&gt;:   callq  0x402080 &lt;sr_Jump&gt;
    0x00000000004030b0 &lt;gen_code+176&gt;:   callq  0x402060 &lt;sr_Halt&gt;
    0x00000000004030b5 &lt;gen_code+181&gt;:   callq  0x4020a0 &lt;sr_Break&gt;
    0x00000000004030ba &lt;gen_code+186&gt;:   callq  0x4020a0 &lt;sr_Break&gt;
    0x00000000004030bf &lt;gen_code+191&gt;:   callq  0x4020a0 &lt;sr_Break&gt;
    0x00000000004030c4 &lt;gen_code+196&gt;:   callq  0x4020a0 &lt;sr_Break&gt;
    0x00000000004030c9 &lt;gen_code+201&gt;:   callq  0x4020a0 &lt;sr_Break&gt;
    0x00000000004030ce &lt;gen_code+206&gt;:   callq  0x4020a0 &lt;sr_Break&gt;
    &lt;...&gt;
</pre>
</div>

<p>
Ещё раз отмечу: на момент начала работы translated этого кода не существовало.
Конечно, вместо того, чтобы без конца их вызывать, правильнее было бы подставить тела
самих сервисных процедур в out<sub>code</sub>. При этом было бы сэкономлено время на входах и
выходах в функции. Но пришлось бы что-то делать с прологами-эпилогами процедур,
т.е. учиться инлайнить код за спиной у компилятора. Я оставлю это упражнение читателям,
желающим поглубже разобраться с вопросами кодогенерации.
</p>

<p>
Наконец, изучим происходящее в main() внутри translate:
</p>

<div class="org-src-container">

<pre class="src src-c"><span style="color: #b22222;">/* </span><span style="color: #b22222;">Code section is protected from writes by default, un-protect it </span><span style="color: #b22222;">*/</span>
<span style="color: #a020f0;">if</span> (mprotect(gen_code, JIT_CODE_SIZE, PROT_READ | PROT_WRITE | PROT_EXEC)) {
    perror(<span style="color: #8b2252;">"mprotect"</span>);
    exit(2);
}
<span style="color: #b22222;">/* </span><span style="color: #b22222;">Pre-populate resulting code buffer with INT3 (machine code 0xCC).</span>
<span style="color: #b22222;">   This will help to catch jumps to wrong locations </span><span style="color: #b22222;">*/</span>
memset(gen_code, 0xcc, JIT_CODE_SIZE);
<span style="color: #228b22;">void</span>* <span style="color: #a0522d;">entrypoints</span>[PROGRAM_SIZE] = {0}; <span style="color: #b22222;">/* </span><span style="color: #b22222;">a map of guest PCs to capsules </span><span style="color: #b22222;">*/</span>

translate_program(cpu.pmem, gen_code, entrypoints, PROGRAM_SIZE);

setjmp(return_buf); <span style="color: #b22222;">/* </span><span style="color: #b22222;">Will get here from generated code. </span><span style="color: #b22222;">*/</span>

<span style="color: #a020f0;">while</span> (cpu.state == Cpu_Running &amp;&amp; cpu.steps &lt; steplimit) {
    <span style="color: #a020f0;">if</span> (cpu.pc &gt; PROGRAM_SIZE) {
        cpu.state = Cpu_Break;
        <span style="color: #a020f0;">break</span>;
    }
    enter_generated_code(entrypoints[cpu.pc]); <span style="color: #b22222;">/* </span><span style="color: #b22222;">Will not return </span><span style="color: #b22222;">*/</span>
}
</pre>
</div>

<p>
Во-первых, обязательно необходимо разрешить запись в gen<sub>code</sub>. Это делается с помощью
системного вызова mprotect(). Затем на всякий случай заполним gen<sub>code</sub> целиком
однобайтовой инструкцией INT3 — 0xcc. Если при исполнении сгенерированного кода что-то
пойдёт не так, и управление передадут на незаполненный участок массива, сразу
произойдёт прерывание, что облегчит отладку.
Затем транслируем программу и устанавливаем точку возврата с помощью setjmp(). Именно
сюда, на начало цикла while(), будет возвращаться исполнение.
</p>

<p>
Цикл while каждый раз будет передавать управление, используя в качестве адреса значения
из отображения entrypoints для текущего PC. Возможно, возник вопрос — а зачем вообще
выходить из gen<sub>code</sub> до окончания работы сгенерированного кода?
</p>

<p>
Обратите своё внимание ещё раз на листинг gen<sub>code</sub> выше. В нём нет ни одной инструкции
ветвления — все MOV и CALL исполнятся последовательно. Однако в исходной программе были
циклы!
Трансляция гостевых инструкций переходов — это сложный момент: смещения адресов
гостевого кода в общем случае нелинейным образом связаны со смещениями между капсулами
кода хозяйского. Я обошёл эту сложность, используя следующий трюк. Все сервисные
процедуры, изменившие PC нелинейным образом (т.е. Jump, JE, JNE), обязаны вызывать
exit<sub>generated</sub><sub>code</sub>(). И уже внешний код, используя сохранённые значения в entrypoints,
заново зайдёт в гостевой код по правильному адресу. Для остальных, «обычных» сервисных
процедур, longjmp не нужен — они просто проваливаются на следующую по коду процедуру.
</p>

<p>
У меня есть идея, как обойтись без longjmp внутри процедур для JNE, JE и Jump. Можно
узнать следующую точку входа из entrypoints сразу внутри процедуры, и поместить
дополнительное значение адреса возврата RIP на стеке так, чтобы при выходе из текущей
процедуры оказаться не в вызывавшей её функции, а сразу в нужной процедуре! Ещё одно
упражнение для пытливого читателя — реализовать эту идею.
</p>

<p>
Узкие места изменились. Теперь VTune обозначил главной проблемой «Front End Bound».
В верх списка попали сервисные процедуры, что можно в некоторой мере считать
успехом.
</p>

<p>
Сравниваемые варианты программ.
</p>

<p>
switched — переключаемый интерпретатор.
threaded — шитый интерпретатор.
predecoded — переключаемый интерпретатор с предварительным декодированием.
subroutined — процедурный интерпретатор.
threaded-cached — шитый с предварительным декодированием интерпретатор.
tailrecursive — процедурный интерпретатор с оптимизированными хвостовыми вызовами.
translated — двоичный транслятор.
native — реализация алгоритма Primes на Си. Не совсем честно сравнивать статичную
программу с реализациями ВМ, способной исполнить произвольный код. Тем не менее, в
сравнении native участвует, чтобы показать потенциал к возможному ускорению.
</p>

<p>
По результатам бенчмарков predecoded работает лишь чуть быстрее switched. По
непонятным мне причинам простой threaded так и остался медленнее switched. А вот
сочетание предварительного декодирования с шитым кодом, threaded-cached, дало заметный
прирост. Удивительно хорошо показали себя процедурный интерпретатор subroutined и
процедурный с хвостовыми оптимизациями tailrecursive. Ожидаемо было и то, что
translated обошёл все интерпретаторы.
</p>
</div>
</div>
</div>
