www/doc/vm-build.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Заключение</h2>
<div class="outline-text-2" id="text-4">
<p>
Как и ожидалось, различные техники построения интерпретаторов различаются по
скорости. Однако нельзя заранее, только из структуры кода ВМ, сделать выводы о том,
какой из вариантов будет быстрее на практике. Более того, различные техники можно
комбинировать, но возникающие при этом эффекты не суммируются: посмотрите, как
изменялась производительность при использовании только предварительного декодирования
или шитого кода, и какой эффект получился от их совместного использования.
Немалую, и не всегда положительную, роль при этом играет компилятор. В зависимости от
применённых им оптимизаций очень простая схема интерпретации может показать себя
хорошо, а вот супернавороченная оказаться в хвосте списка.
Статья написана, совесть моя перед самим собой чиста, пора и в отпуск. Спасибо за
внимание!
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Литература</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Баранов С. Н., Ноздрунов Н. Р. Язык Форт и его реализации. 1988 Издательство
«Машиностроение» 2.1. Шитый код и его разновидности
</li>
<li>www.netlib.narod.ru/library/book0001/ch02<sub>01</sub>.htm
</li>
<li>M. Anton Ertl. 2007. Speed of various interpreter dispatch techniques V2
</li>
<li>www.complang.tuwien.ac.at/forth/threading
</li>
<li>James E. Smith and Ravi Nair. Virtual machines – Versatile Platforms for Systems
and Processes. Elsevier, 2005. ISBN 978-1-55860-910-5.
</li>
<li>M. Anton Ertl and David Gregg. The structure and performance of efficient
interpreters - Journal of Instruction-Level Parallelism 5 (2003), pp. 1–25. www.jilp.org/vol5/v5paper12.pdf
</li>
<li>Terrence Parr. Language Implementation Patterns — The Pragmatic Bookshelf, 2010. ISBN-10: 1-934356-45-X ISBN-13: 978-1-934356-45-6
</li>
</ul>
</div>
</div>
</div>
</body>
</html>
